MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
extern volatile PWM2ERSPPSbits_t PWM2ERSPPSbits __at(0x254);
// bitfield macros
#define _PWM2ERSPPS_PIN_POSN                                0x0
#define _PWM2ERSPPS_PIN_POSITION                            0x0
#define _PWM2ERSPPS_PIN_SIZE                                0x3
#define _PWM2ERSPPS_PIN_LENGTH                              0x3
#define _PWM2ERSPPS_PIN_MASK                                0x7
#define _PWM2ERSPPS_PORT_POSN                               0x3
#define _PWM2ERSPPS_PORT_POSITION                           0x3
#define _PWM2ERSPPS_PORT_SIZE                               0x3
#define _PWM2ERSPPS_PORT_LENGTH                             0x3
#define _PWM2ERSPPS_PORT_MASK                               0x38
#define _PWM2ERSPPS_PWM2ERSPPS_POSN                         0x0
#define _PWM2ERSPPS_PWM2ERSPPS_POSITION                     0x0
#define _PWM2ERSPPS_PWM2ERSPPS_SIZE                         0x6
#define _PWM2ERSPPS_PWM2ERSPPS_LENGTH                       0x6
#define _PWM2ERSPPS_PWM2ERSPPS_MASK                         0x3F
#define _PWM2ERSPPS_PWM2ERSPPS0_POSN                        0x0
#define _PWM2ERSPPS_PWM2ERSPPS0_POSITION                    0x0
#define _PWM2ERSPPS_PWM2ERSPPS0_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS0_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS0_MASK                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS1_POSN                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS1_POSITION                    0x1
#define _PWM2ERSPPS_PWM2ERSPPS1_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS1_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS1_MASK                        0x2
#define _PWM2ERSPPS_PWM2ERSPPS2_POSN                        0x2
#define _PWM2ERSPPS_PWM2ERSPPS2_POSITION                    0x2
#define _PWM2ERSPPS_PWM2ERSPPS2_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS2_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS2_MASK                        0x4
#define _PWM2ERSPPS_PWM2ERSPPS3_POSN                        0x3
#define _PWM2ERSPPS_PWM2ERSPPS3_POSITION                    0x3
#define _PWM2ERSPPS_PWM2ERSPPS3_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS3_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS3_MASK                        0x8
#define _PWM2ERSPPS_PWM2ERSPPS4_POSN                        0x4
#define _PWM2ERSPPS_PWM2ERSPPS4_POSITION                    0x4
#define _PWM2ERSPPS_PWM2ERSPPS4_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS4_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS4_MASK                        0x10
#define _PWM2ERSPPS_PWM2ERSPPS5_POSN                        0x5
#define _PWM2ERSPPS_PWM2ERSPPS5_POSITION                    0x5
#define _PWM2ERSPPS_PWM2ERSPPS5_SIZE                        0x1
#define _PWM2ERSPPS_PWM2ERSPPS5_LENGTH                      0x1
#define _PWM2ERSPPS_PWM2ERSPPS5_MASK                        0x20

// Register: PWM3ERSPPS
#define PWM3ERSPPS PWM3ERSPPS
extern volatile unsigned char           PWM3ERSPPS          __at(0x255);
#ifndef _LIB_BUILD
asm("PWM3ERSPPS equ 0255h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned PWM3ERSPPS             :5;
    };
    struct {
        unsigned PWM3ERSPPS0            :1;
        unsigned PWM3ERSPPS1            :1;
        unsigned PWM3ERSPPS2            :1;
        unsigned PWM3ERSPPS3            :1;
        unsigned PWM3ERSPPS4            :1;
    };
} PWM3ERSPPSbits_t;
extern volatile PWM3ERSPPSbits_t PWM3ERSPPSbits __at(0x255);
// bitfield macros
#define _PWM3ERSPPS_PIN_POSN                                0x0
#define _PWM3ERSPPS_PIN_POSITION                            0x0
#define _PWM3ERSPPS_PIN_SIZE                                0x3
#define _PWM3ERSPPS_PIN_LENGTH                              0x3
#define _PWM3ERSPPS_PIN_MASK                                0x7
#define _PWM3ERSPPS_PORT_POSN                               0x3
#define _PWM3ERSPPS_PORT_POSITION                           0x3
#define _PWM3ERSPPS_PORT_SIZE                               0x2
#define _PWM3ERSPPS_PORT_LENGTH                             0x2
#define _PWM3ERSPPS_PORT_MASK                               0x18
#define _PWM3ERSPPS_PWM3ERSPPS_POSN                         0x0
#define _PWM3ERSPPS_PWM3ERSPPS_POSITION                     0x0
#define _PWM3ERSPPS_PWM3ERSPPS_SIZE                         0x5
#define _PWM3ERSPPS_PWM3ERSPPS_LENGTH                       0x5
#define _PWM3ERSPPS_PWM3ERSPPS_MASK                         0x1F
#define _PWM3ERSPPS_PWM3ERSPPS0_POSN                        0x0
#define _PWM3ERSPPS_PWM3ERSPPS0_POSITION                    0x0
#define _PWM3ERSPPS_PWM3ERSPPS0_SIZE                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS0_LENGTH                      0x1
#define _PWM3ERSPPS_PWM3ERSPPS0_MASK                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS1_POSN                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS1_POSITION                    0x1
#define _PWM3ERSPPS_PWM3ERSPPS1_SIZE                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS1_LENGTH                      0x1
#define _PWM3ERSPPS_PWM3ERSPPS1_MASK                        0x2
#define _PWM3ERSPPS_PWM3ERSPPS2_POSN                        0x2
#define _PWM3ERSPPS_PWM3ERSPPS2_POSITION                    0x2
#define _PWM3ERSPPS_PWM3ERSPPS2_SIZE                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS2_LENGTH                      0x1
#define _PWM3ERSPPS_PWM3ERSPPS2_MASK                        0x4
#define _PWM3ERSPPS_PWM3ERSPPS3_POSN                        0x3
#define _PWM3ERSPPS_PWM3ERSPPS3_POSITION                    0x3
#define _PWM3ERSPPS_PWM3ERSPPS3_SIZE                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS3_LENGTH                      0x1
#define _PWM3ERSPPS_PWM3ERSPPS3_MASK                        0x8
#define _PWM3ERSPPS_PWM3ERSPPS4_POSN                        0x4
#define _PWM3ERSPPS_PWM3ERSPPS4_POSITION                    0x4
#define _PWM3ERSPPS_PWM3ERSPPS4_SIZE                        0x1
#define _PWM3ERSPPS_PWM3ERSPPS4_LENGTH                      0x1
#define _PWM3ERSPPS_PWM3ERSPPS4_MASK                        0x10

