MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
extern volatile unsigned char           SPI1SDIPPS          __at(0x26B);
#ifndef _LIB_BUILD
asm("SPI1SDIPPS equ 026Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI1SDIPPS             :5;
    };
    struct {
        unsigned SPI1SDIPPS0            :1;
        unsigned SPI1SDIPPS1            :1;
        unsigned SPI1SDIPPS2            :1;
        unsigned SPI1SDIPPS3            :1;
        unsigned SPI1SDIPPS4            :1;
    };
} SPI1SDIPPSbits_t;
extern volatile SPI1SDIPPSbits_t SPI1SDIPPSbits __at(0x26B);
// bitfield macros
#define _SPI1SDIPPS_PIN_POSN                                0x0
#define _SPI1SDIPPS_PIN_POSITION                            0x0
#define _SPI1SDIPPS_PIN_SIZE                                0x3
#define _SPI1SDIPPS_PIN_LENGTH                              0x3
#define _SPI1SDIPPS_PIN_MASK                                0x7
#define _SPI1SDIPPS_PORT_POSN                               0x3
#define _SPI1SDIPPS_PORT_POSITION                           0x3
#define _SPI1SDIPPS_PORT_SIZE                               0x2
#define _SPI1SDIPPS_PORT_LENGTH                             0x2
#define _SPI1SDIPPS_PORT_MASK                               0x18
#define _SPI1SDIPPS_SPI1SDIPPS_POSN                         0x0
#define _SPI1SDIPPS_SPI1SDIPPS_POSITION                     0x0
#define _SPI1SDIPPS_SPI1SDIPPS_SIZE                         0x5
#define _SPI1SDIPPS_SPI1SDIPPS_LENGTH                       0x5
#define _SPI1SDIPPS_SPI1SDIPPS_MASK                         0x1F
#define _SPI1SDIPPS_SPI1SDIPPS0_POSN                        0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_POSITION                    0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_MASK                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSN                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSITION                    0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_MASK                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSN                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSITION                    0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_MASK                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS3_POSN                        0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_POSITION                    0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_MASK                        0x8
#define _SPI1SDIPPS_SPI1SDIPPS4_POSN                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_POSITION                    0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_MASK                        0x10

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
extern volatile unsigned char           SPI1SSPPS           __at(0x26C);
#ifndef _LIB_BUILD
asm("SPI1SSPPS equ 026Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI1SSPPS              :5;
    };
    struct {
        unsigned SPI1SSPPS0             :1;
        unsigned SPI1SSPPS1             :1;
        unsigned SPI1SSPPS2             :1;
        unsigned SPI1SSPPS3             :1;
        unsigned SPI1SSPPS4             :1;
    };
} SPI1SSPPSbits_t;
extern volatile SPI1SSPPSbits_t SPI1SSPPSbits __at(0x26C);
// bitfield macros
#define _SPI1SSPPS_PIN_POSN                                 0x0
#define _SPI1SSPPS_PIN_POSITION                             0x0
#define _SPI1SSPPS_PIN_SIZE                                 0x3
#define _SPI1SSPPS_PIN_LENGTH                               0x3
#define _SPI1SSPPS_PIN_MASK                                 0x7
#define _SPI1SSPPS_PORT_POSN                                0x3
#define _SPI1SSPPS_PORT_POSITION                            0x3
#define _SPI1SSPPS_PORT_SIZE                                0x2
#define _SPI1SSPPS_PORT_LENGTH                              0x2
#define _SPI1SSPPS_PORT_MASK                                0x18
#define _SPI1SSPPS_SPI1SSPPS_POSN                           0x0
#define _SPI1SSPPS_SPI1SSPPS_POSITION                       0x0
#define _SPI1SSPPS_SPI1SSPPS_SIZE                           0x5
#define _SPI1SSPPS_SPI1SSPPS_LENGTH                         0x5
#define _SPI1SSPPS_SPI1SSPPS_MASK                           0x1F
#define _SPI1SSPPS_SPI1SSPPS0_POSN                          0x0
#define _SPI1SSPPS_SPI1SSPPS0_POSITION                      0x0
#define _SPI1SSPPS_SPI1SSPPS0_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS0_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS0_MASK                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSN                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSITION                      0x1
#define _SPI1SSPPS_SPI1SSPPS1_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS1_MASK                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSN                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSITION                      0x2
#define _SPI1SSPPS_SPI1SSPPS2_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS2_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS2_MASK                          0x4
#define _SPI1SSPPS_SPI1SSPPS3_POSN                          0x3
#define _SPI1SSPPS_SPI1SSPPS3_POSITION                      0x3
#define _SPI1SSPPS_SPI1SSPPS3_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS3_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS3_MASK                          0x8
#define _SPI1SSPPS_SPI1SSPPS4_POSN                          0x4
#define _SPI1SSPPS_SPI1SSPPS4_POSITION                      0x4
#define _SPI1SSPPS_SPI1SSPPS4_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS4_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS4_MASK                          0x10

// Register: SPI2SCKPPS
#define SPI2SCKPPS SPI2SCKPPS
extern volatile unsigned char           SPI2SCKPPS          __at(0x26D);
#ifndef _LIB_BUILD
asm("SPI2SCKPPS equ 026Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI2SCKPPS             :5;
    };
    struct {
        unsigned SPI2SCKPPS0            :1;
        unsigned SPI2SCKPPS1            :1;
        unsigned SPI2SCKPPS2            :1;
        unsigned SPI2SCKPPS3            :1;
        unsigned SPI2SCKPPS4            :1;
    };
} SPI2SCKPPSbits_t;
extern volatile SPI2SCKPPSbits_t SPI2SCKPPSbits __at(0x26D);
// bitfield macros
#define _SPI2SCKPPS_PIN_POSN                                0x0
#define _SPI2SCKPPS_PIN_POSITION                            0x0
#define _SPI2SCKPPS_PIN_SIZE                                0x3
#define _SPI2SCKPPS_PIN_LENGTH                              0x3
#define _SPI2SCKPPS_PIN_MASK                                0x7
#define _SPI2SCKPPS_PORT_POSN                               0x3
#define _SPI2SCKPPS_PORT_POSITION                           0x3
#define _SPI2SCKPPS_PORT_SIZE                               0x2
#define _SPI2SCKPPS_PORT_LENGTH                             0x2
#define _SPI2SCKPPS_PORT_MASK                               0x18
#define _SPI2SCKPPS_SPI2SCKPPS_POSN                         0x0
#define _SPI2SCKPPS_SPI2SCKPPS_POSITION                     0x0
#define _SPI2SCKPPS_SPI2SCKPPS_SIZE                         0x5
#define _SPI2SCKPPS_SPI2SCKPPS_LENGTH                       0x5
#define _SPI2SCKPPS_SPI2SCKPPS_MASK                         0x1F
#define _SPI2SCKPPS_SPI2SCKPPS0_POSN                        0x0
#define _SPI2SCKPPS_SPI2SCKPPS0_POSITION                    0x0
#define _SPI2SCKPPS_SPI2SCKPPS0_SIZE                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS0_LENGTH                      0x1
#define _SPI2SCKPPS_SPI2SCKPPS0_MASK                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS1_POSN                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS1_POSITION                    0x1
#define _SPI2SCKPPS_SPI2SCKPPS1_SIZE                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS1_LENGTH                      0x1
#define _SPI2SCKPPS_SPI2SCKPPS1_MASK                        0x2
#define _SPI2SCKPPS_SPI2SCKPPS2_POSN                        0x2
#define _SPI2SCKPPS_SPI2SCKPPS2_POSITION                    0x2
#define _SPI2SCKPPS_SPI2SCKPPS2_SIZE                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS2_LENGTH                      0x1
#define _SPI2SCKPPS_SPI2SCKPPS2_MASK                        0x4
#define _SPI2SCKPPS_SPI2SCKPPS3_POSN                        0x3
#define _SPI2SCKPPS_SPI2SCKPPS3_POSITION                    0x3
#define _SPI2SCKPPS_SPI2SCKPPS3_SIZE                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS3_LENGTH                      0x1
#define _SPI2SCKPPS_SPI2SCKPPS3_MASK                        0x8
#define _SPI2SCKPPS_SPI2SCKPPS4_POSN                        0x4
#define _SPI2SCKPPS_SPI2SCKPPS4_POSITION                    0x4
#define _SPI2SCKPPS_SPI2SCKPPS4_SIZE                        0x1
#define _SPI2SCKPPS_SPI2SCKPPS4_LENGTH                      0x1
#define _SPI2SCKPPS_SPI2SCKPPS4_MASK                        0x10

// Register: SPI2SDIPPS
#define SPI2SDIPPS SPI2SDIPPS
extern volatile unsigned char           SPI2SDIPPS          __at(0x26E);
#ifndef _LIB_BUILD
asm("SPI2SDIPPS equ 026Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI2SDIPPS             :5;
    };
    struct {
        unsigned SPI2SDIPPS0            :1;
        unsigned SPI2SDIPPS1            :1;
        unsigned SPI2SDIPPS2            :1;
        unsigned SPI2SDIPPS3            :1;
        unsigned SPI2SDIPPS4            :1;
    };
} SPI2SDIPPSbits_t;
extern volatile SPI2SDIPPSbits_t SPI2SDIPPSbits __at(0x26E);
// bitfield macros
#define _SPI2SDIPPS_PIN_POSN                                0x0
#define _SPI2SDIPPS_PIN_POSITION                            0x0
#define _SPI2SDIPPS_PIN_SIZE                                0x3
#define _SPI2SDIPPS_PIN_LENGTH                              0x3
#define _SPI2SDIPPS_PIN_MASK                                0x7
#define _SPI2SDIPPS_PORT_POSN                               0x3
#define _SPI2SDIPPS_PORT_POSITION                           0x3
#define _SPI2SDIPPS_PORT_SIZE                               0x2
#define _SPI2SDIPPS_PORT_LENGTH                             0x2
#define _SPI2SDIPPS_PORT_MASK                               0x18
#define _SPI2SDIPPS_SPI2SDIPPS_POSN                         0x0
#define _SPI2SDIPPS_SPI2SDIPPS_POSITION                     0x0
#define _SPI2SDIPPS_SPI2SDIPPS_SIZE                         0x5
#define _SPI2SDIPPS_SPI2SDIPPS_LENGTH                       0x5
#define _SPI2SDIPPS_SPI2SDIPPS_MASK                         0x1F
#define _SPI2SDIPPS_SPI2SDIPPS0_POSN                        0x0
#define _SPI2SDIPPS_SPI2SDIPPS0_POSITION                    0x0
#define _SPI2SDIPPS_SPI2SDIPPS0_SIZE                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS0_LENGTH                      0x1
#define _SPI2SDIPPS_SPI2SDIPPS0_MASK                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS1_POSN                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS1_POSITION                    0x1
#define _SPI2SDIPPS_SPI2SDIPPS1_SIZE                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS1_LENGTH                      0x1
#define _SPI2SDIPPS_SPI2SDIPPS1_MASK                        0x2
#define _SPI2SDIPPS_SPI2SDIPPS2_POSN                        0x2
#define _SPI2SDIPPS_SPI2SDIPPS2_POSITION                    0x2
#define _SPI2SDIPPS_SPI2SDIPPS2_SIZE                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS2_LENGTH                      0x1
#define _SPI2SDIPPS_SPI2SDIPPS2_MASK                        0x4
#define _SPI2SDIPPS_SPI2SDIPPS3_POSN                        0x3
#define _SPI2SDIPPS_SPI2SDIPPS3_POSITION                    0x3
#define _SPI2SDIPPS_SPI2SDIPPS3_SIZE                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS3_LENGTH                      0x1
#define _SPI2SDIPPS_SPI2SDIPPS3_MASK                        0x8
#define _SPI2SDIPPS_SPI2SDIPPS4_POSN                        0x4
#define _SPI2SDIPPS_SPI2SDIPPS4_POSITION                    0x4
#define _SPI2SDIPPS_SPI2SDIPPS4_SIZE                        0x1
#define _SPI2SDIPPS_SPI2SDIPPS4_LENGTH                      0x1
#define _SPI2SDIPPS_SPI2SDIPPS4_MASK                        0x10

// Register: SPI2SSPPS
#define SPI2SSPPS SPI2SSPPS
extern volatile unsigned char           SPI2SSPPS           __at(0x26F);
#ifndef _LIB_BUILD
asm("SPI2SSPPS equ 026Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SPI2SSPPS              :5;
    };
    struct {
        unsigned SPI2SSPPS0             :1;
        unsigned SPI2SSPPS1             :1;
        unsigned SPI2SSPPS2             :1;
        unsigned SPI2SSPPS3             :1;
        unsigned SPI2SSPPS4             :1;
    };
} SPI2SSPPSbits_t;
extern volatile SPI2SSPPSbits_t SPI2SSPPSbits __at(0x26F);
// bitfield macros
#define _SPI2SSPPS_PIN_POSN                                 0x0
#define _SPI2SSPPS_PIN_POSITION                             0x0
#define _SPI2SSPPS_PIN_SIZE                                 0x3
#define _SPI2SSPPS_PIN_LENGTH                               0x3
#define _SPI2SSPPS_PIN_MASK                                 0x7
#define _SPI2SSPPS_PORT_POSN                                0x3
#define _SPI2SSPPS_PORT_POSITION                            0x3
#define _SPI2SSPPS_PORT_SIZE                                0x2
#define _SPI2SSPPS_PORT_LENGTH                              0x2
#define _SPI2SSPPS_PORT_MASK                                0x18
#define _SPI2SSPPS_SPI2SSPPS_POSN                           0x0
#define _SPI2SSPPS_SPI2SSPPS_POSITION                       0x0
#define _SPI2SSPPS_SPI2SSPPS_SIZE                           0x5
#define _SPI2SSPPS_SPI2SSPPS_LENGTH                         0x5
#define _SPI2SSPPS_SPI2SSPPS_MASK                           0x1F
#define _SPI2SSPPS_SPI2SSPPS0_POSN                          0x0
#define _SPI2SSPPS_SPI2SSPPS0_POSITION                      0x0
#define _SPI2SSPPS_SPI2SSPPS0_SIZE                          0x1
#define _SPI2SSPPS_SPI2SSPPS0_LENGTH                        0x1
#define _SPI2SSPPS_SPI2SSPPS0_MASK                          0x1
#define _SPI2SSPPS_SPI2SSPPS1_POSN                          0x1
#define _SPI2SSPPS_SPI2SSPPS1_POSITION                      0x1
#define _SPI2SSPPS_SPI2SSPPS1_SIZE                          0x1
#define _SPI2SSPPS_SPI2SSPPS1_LENGTH                        0x1
#define _SPI2SSPPS_SPI2SSPPS1_MASK                          0x2
#define _SPI2SSPPS_SPI2SSPPS2_POSN                          0x2
#define _SPI2SSPPS_SPI2SSPPS2_POSITION                      0x2
#define _SPI2SSPPS_SPI2SSPPS2_SIZE                          0x1
#define _SPI2SSPPS_SPI2SSPPS2_LENGTH                        0x1
#define _SPI2SSPPS_SPI2SSPPS2_MASK                          0x4
#define _SPI2SSPPS_SPI2SSPPS3_POSN                          0x3
#define _SPI2SSPPS_SPI2SSPPS3_POSITION                      0x3
#define _SPI2SSPPS_SPI2SSPPS3_SIZE                          0x1
#define _SPI2SSPPS_SPI2SSPPS3_LENGTH                        0x1
#define _SPI2SSPPS_SPI2SSPPS3_MASK                          0x8
#define _SPI2SSPPS_SPI2SSPPS4_POSN                          0x4
#define _SPI2SSPPS_SPI2SSPPS4_POSITION                      0x4
#define _SPI2SSPPS_SPI2SSPPS4_SIZE                          0x1
#define _SPI2SSPPS_SPI2SSPPS4_LENGTH                        0x1
#define _SPI2SSPPS_SPI2SSPPS4_MASK                          0x10

