MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
extern volatile U4RXPPSbits_t U4RXPPSbits __at(0x278);
// bitfield macros
#define _U4RXPPS_PIN_POSN                                   0x0
#define _U4RXPPS_PIN_POSITION                               0x0
#define _U4RXPPS_PIN_SIZE                                   0x3
#define _U4RXPPS_PIN_LENGTH                                 0x3
#define _U4RXPPS_PIN_MASK                                   0x7
#define _U4RXPPS_PORT_POSN                                  0x3
#define _U4RXPPS_PORT_POSITION                              0x3
#define _U4RXPPS_PORT_SIZE                                  0x2
#define _U4RXPPS_PORT_LENGTH                                0x2
#define _U4RXPPS_PORT_MASK                                  0x18
#define _U4RXPPS_U4RXPPS_POSN                               0x0
#define _U4RXPPS_U4RXPPS_POSITION                           0x0
#define _U4RXPPS_U4RXPPS_SIZE                               0x5
#define _U4RXPPS_U4RXPPS_LENGTH                             0x5
#define _U4RXPPS_U4RXPPS_MASK                               0x1F
#define _U4RXPPS_U4RXPPS0_POSN                              0x0
#define _U4RXPPS_U4RXPPS0_POSITION                          0x0
#define _U4RXPPS_U4RXPPS0_SIZE                              0x1
#define _U4RXPPS_U4RXPPS0_LENGTH                            0x1
#define _U4RXPPS_U4RXPPS0_MASK                              0x1
#define _U4RXPPS_U4RXPPS1_POSN                              0x1
#define _U4RXPPS_U4RXPPS1_POSITION                          0x1
#define _U4RXPPS_U4RXPPS1_SIZE                              0x1
#define _U4RXPPS_U4RXPPS1_LENGTH                            0x1
#define _U4RXPPS_U4RXPPS1_MASK                              0x2
#define _U4RXPPS_U4RXPPS2_POSN                              0x2
#define _U4RXPPS_U4RXPPS2_POSITION                          0x2
#define _U4RXPPS_U4RXPPS2_SIZE                              0x1
#define _U4RXPPS_U4RXPPS2_LENGTH                            0x1
#define _U4RXPPS_U4RXPPS2_MASK                              0x4
#define _U4RXPPS_U4RXPPS3_POSN                              0x3
#define _U4RXPPS_U4RXPPS3_POSITION                          0x3
#define _U4RXPPS_U4RXPPS3_SIZE                              0x1
#define _U4RXPPS_U4RXPPS3_LENGTH                            0x1
#define _U4RXPPS_U4RXPPS3_MASK                              0x8
#define _U4RXPPS_U4RXPPS4_POSN                              0x4
#define _U4RXPPS_U4RXPPS4_POSITION                          0x4
#define _U4RXPPS_U4RXPPS4_SIZE                              0x1
#define _U4RXPPS_U4RXPPS4_LENGTH                            0x1
#define _U4RXPPS_U4RXPPS4_MASK                              0x10

// Register: U4CTSPPS
#define U4CTSPPS U4CTSPPS
extern volatile unsigned char           U4CTSPPS            __at(0x279);
#ifndef _LIB_BUILD
asm("U4CTSPPS equ 0279h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned U4CTSPPS               :5;
    };
    struct {
        unsigned U4CTSPPS0              :1;
        unsigned U4CTSPPS1              :1;
        unsigned U4CTSPPS2              :1;
        unsigned U4CTSPPS3              :1;
        unsigned U4CTSPPS4              :1;
    };
} U4CTSPPSbits_t;
extern volatile U4CTSPPSbits_t U4CTSPPSbits __at(0x279);
// bitfield macros
#define _U4CTSPPS_PIN_POSN                                  0x0
#define _U4CTSPPS_PIN_POSITION                              0x0
#define _U4CTSPPS_PIN_SIZE                                  0x3
#define _U4CTSPPS_PIN_LENGTH                                0x3
#define _U4CTSPPS_PIN_MASK                                  0x7
#define _U4CTSPPS_PORT_POSN                                 0x3
#define _U4CTSPPS_PORT_POSITION                             0x3
#define _U4CTSPPS_PORT_SIZE                                 0x2
#define _U4CTSPPS_PORT_LENGTH                               0x2
#define _U4CTSPPS_PORT_MASK                                 0x18
#define _U4CTSPPS_U4CTSPPS_POSN                             0x0
#define _U4CTSPPS_U4CTSPPS_POSITION                         0x0
#define _U4CTSPPS_U4CTSPPS_SIZE                             0x5
#define _U4CTSPPS_U4CTSPPS_LENGTH                           0x5
#define _U4CTSPPS_U4CTSPPS_MASK                             0x1F
#define _U4CTSPPS_U4CTSPPS0_POSN                            0x0
#define _U4CTSPPS_U4CTSPPS0_POSITION                        0x0
#define _U4CTSPPS_U4CTSPPS0_SIZE                            0x1
#define _U4CTSPPS_U4CTSPPS0_LENGTH                          0x1
#define _U4CTSPPS_U4CTSPPS0_MASK                            0x1
#define _U4CTSPPS_U4CTSPPS1_POSN                            0x1
#define _U4CTSPPS_U4CTSPPS1_POSITION                        0x1
#define _U4CTSPPS_U4CTSPPS1_SIZE                            0x1
#define _U4CTSPPS_U4CTSPPS1_LENGTH                          0x1
#define _U4CTSPPS_U4CTSPPS1_MASK                            0x2
#define _U4CTSPPS_U4CTSPPS2_POSN                            0x2
#define _U4CTSPPS_U4CTSPPS2_POSITION                        0x2
#define _U4CTSPPS_U4CTSPPS2_SIZE                            0x1
#define _U4CTSPPS_U4CTSPPS2_LENGTH                          0x1
#define _U4CTSPPS_U4CTSPPS2_MASK                            0x4
#define _U4CTSPPS_U4CTSPPS3_POSN                            0x3
#define _U4CTSPPS_U4CTSPPS3_POSITION                        0x3
#define _U4CTSPPS_U4CTSPPS3_SIZE                            0x1
#define _U4CTSPPS_U4CTSPPS3_LENGTH                          0x1
#define _U4CTSPPS_U4CTSPPS3_MASK                            0x8
#define _U4CTSPPS_U4CTSPPS4_POSN                            0x4
#define _U4CTSPPS_U4CTSPPS4_POSITION                        0x4
#define _U4CTSPPS_U4CTSPPS4_SIZE                            0x1
#define _U4CTSPPS_U4CTSPPS4_LENGTH                          0x1
#define _U4CTSPPS_U4CTSPPS4_MASK                            0x10

// Register: U5RXPPS
#define U5RXPPS U5RXPPS
extern volatile unsigned char           U5RXPPS             __at(0x27A);
#ifndef _LIB_BUILD
asm("U5RXPPS equ 027Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U5RXPPS                :6;
    };
    struct {
        unsigned U5RXPPS0               :1;
        unsigned U5RXPPS1               :1;
        unsigned U5RXPPS2               :1;
        unsigned U5RXPPS3               :1;
        unsigned U5RXPPS4               :1;
        unsigned U5RXPPS5               :1;
    };
} U5RXPPSbits_t;
