MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
extern volatile U4BRGLbits_t U4BRGLbits __at(0x2E7);
// bitfield macros
#define _U4BRGL_BRGL_POSN                                   0x0
#define _U4BRGL_BRGL_POSITION                               0x0
#define _U4BRGL_BRGL_SIZE                                   0x8
#define _U4BRGL_BRGL_LENGTH                                 0x8
#define _U4BRGL_BRGL_MASK                                   0xFF

// Register: U4BRGH
#define U4BRGH U4BRGH
extern volatile unsigned char           U4BRGH              __at(0x2E8);
#ifndef _LIB_BUILD
asm("U4BRGH equ 02E8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U4BRGHbits_t;
extern volatile U4BRGHbits_t U4BRGHbits __at(0x2E8);
// bitfield macros
#define _U4BRGH_BRGH_POSN                                   0x0
#define _U4BRGH_BRGH_POSITION                               0x0
#define _U4BRGH_BRGH_SIZE                                   0x8
#define _U4BRGH_BRGH_LENGTH                                 0x8
#define _U4BRGH_BRGH_MASK                                   0xFF

// Register: U4FIFO
#define U4FIFO U4FIFO
extern volatile unsigned char           U4FIFO              __at(0x2E9);
#ifndef _LIB_BUILD
asm("U4FIFO equ 02E9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U4RXBF                 :1;
        unsigned U4RXBE                 :1;
        unsigned U4XON                  :1;
        unsigned U4RXIDL                :1;
        unsigned U4TXBF                 :1;
        unsigned U4TXBE                 :1;
        unsigned U4STPMD                :1;
        unsigned U4TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U4RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U4FIFObits_t;
extern volatile U4FIFObits_t U4FIFObits __at(0x2E9);
// bitfield macros
#define _U4FIFO_RXBF_POSN                                   0x0
#define _U4FIFO_RXBF_POSITION                               0x0
#define _U4FIFO_RXBF_SIZE                                   0x1
#define _U4FIFO_RXBF_LENGTH                                 0x1
#define _U4FIFO_RXBF_MASK                                   0x1
#define _U4FIFO_RXBE_POSN                                   0x1
#define _U4FIFO_RXBE_POSITION                               0x1
#define _U4FIFO_RXBE_SIZE                                   0x1
#define _U4FIFO_RXBE_LENGTH                                 0x1
#define _U4FIFO_RXBE_MASK                                   0x2
#define _U4FIFO_XON_POSN                                    0x2
#define _U4FIFO_XON_POSITION                                0x2
#define _U4FIFO_XON_SIZE                                    0x1
#define _U4FIFO_XON_LENGTH                                  0x1
#define _U4FIFO_XON_MASK                                    0x4
#define _U4FIFO_RXIDL_POSN                                  0x3
#define _U4FIFO_RXIDL_POSITION                              0x3
#define _U4FIFO_RXIDL_SIZE                                  0x1
#define _U4FIFO_RXIDL_LENGTH                                0x1
#define _U4FIFO_RXIDL_MASK                                  0x8
#define _U4FIFO_TXBF_POSN                                   0x4
#define _U4FIFO_TXBF_POSITION                               0x4
#define _U4FIFO_TXBF_SIZE                                   0x1
#define _U4FIFO_TXBF_LENGTH                                 0x1
#define _U4FIFO_TXBF_MASK                                   0x10
#define _U4FIFO_TXBE_POSN                                   0x5
#define _U4FIFO_TXBE_POSITION                               0x5
#define _U4FIFO_TXBE_SIZE                                   0x1
#define _U4FIFO_TXBE_LENGTH                                 0x1
#define _U4FIFO_TXBE_MASK                                   0x20
#define _U4FIFO_STPMD_POSN                                  0x6
#define _U4FIFO_STPMD_POSITION                              0x6
#define _U4FIFO_STPMD_SIZE                                  0x1
#define _U4FIFO_STPMD_LENGTH                                0x1
#define _U4FIFO_STPMD_MASK                                  0x40
#define _U4FIFO_TXWRE_POSN                                  0x7
#define _U4FIFO_TXWRE_POSITION                              0x7
#define _U4FIFO_TXWRE_SIZE                                  0x1
#define _U4FIFO_TXWRE_LENGTH                                0x1
#define _U4FIFO_TXWRE_MASK                                  0x80
#define _U4FIFO_U4RXBF_POSN                                 0x0
#define _U4FIFO_U4RXBF_POSITION                             0x0
#define _U4FIFO_U4RXBF_SIZE                                 0x1
#define _U4FIFO_U4RXBF_LENGTH                               0x1
#define _U4FIFO_U4RXBF_MASK                                 0x1
#define _U4FIFO_U4RXBE_POSN                                 0x1
#define _U4FIFO_U4RXBE_POSITION                             0x1
#define _U4FIFO_U4RXBE_SIZE                                 0x1
#define _U4FIFO_U4RXBE_LENGTH                               0x1
#define _U4FIFO_U4RXBE_MASK                                 0x2
#define _U4FIFO_U4XON_POSN                                  0x2
#define _U4FIFO_U4XON_POSITION                              0x2
#define _U4FIFO_U4XON_SIZE                                  0x1
#define _U4FIFO_U4XON_LENGTH                                0x1
#define _U4FIFO_U4XON_MASK                                  0x4
#define _U4FIFO_U4RXIDL_POSN                                0x3
#define _U4FIFO_U4RXIDL_POSITION                            0x3
#define _U4FIFO_U4RXIDL_SIZE                                0x1
#define _U4FIFO_U4RXIDL_LENGTH                              0x1
#define _U4FIFO_U4RXIDL_MASK                                0x8
#define _U4FIFO_U4TXBF_POSN                                 0x4
#define _U4FIFO_U4TXBF_POSITION                             0x4
#define _U4FIFO_U4TXBF_SIZE                                 0x1
#define _U4FIFO_U4TXBF_LENGTH                               0x1
#define _U4FIFO_U4TXBF_MASK                                 0x10
#define _U4FIFO_U4TXBE_POSN                                 0x5
#define _U4FIFO_U4TXBE_POSITION                             0x5
#define _U4FIFO_U4TXBE_SIZE                                 0x1
#define _U4FIFO_U4TXBE_LENGTH                               0x1
#define _U4FIFO_U4TXBE_MASK                                 0x20
#define _U4FIFO_U4STPMD_POSN                                0x6
#define _U4FIFO_U4STPMD_POSITION                            0x6
#define _U4FIFO_U4STPMD_SIZE                                0x1
#define _U4FIFO_U4STPMD_LENGTH                              0x1
#define _U4FIFO_U4STPMD_MASK                                0x40
#define _U4FIFO_U4TXWRE_POSN                                0x7
#define _U4FIFO_U4TXWRE_POSITION                            0x7
#define _U4FIFO_U4TXWRE_SIZE                                0x1
#define _U4FIFO_U4TXWRE_LENGTH                              0x1
#define _U4FIFO_U4TXWRE_MASK                                0x80
#define _U4FIFO_U4RCIDL_POSN                                0x3
#define _U4FIFO_U4RCIDL_POSITION                            0x3
#define _U4FIFO_U4RCIDL_SIZE                                0x1
#define _U4FIFO_U4RCIDL_LENGTH                              0x1
#define _U4FIFO_U4RCIDL_MASK                                0x8
#define _U4FIFO_RCIDL_POSN                                  0x3
#define _U4FIFO_RCIDL_POSITION                              0x3
#define _U4FIFO_RCIDL_SIZE                                  0x1
#define _U4FIFO_RCIDL_LENGTH                                0x1
#define _U4FIFO_RCIDL_MASK                                  0x8

// Register: U4UIR
#define U4UIR U4UIR
extern volatile unsigned char           U4UIR               __at(0x2EA);
#ifndef _LIB_BUILD
asm("U4UIR equ 02EAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U4ABDIE                :1;
        unsigned                        :3;
        unsigned U4ABDIF                :1;
        unsigned U4WUIF                 :1;
    };
} U4UIRbits_t;
extern volatile U4UIRbits_t U4UIRbits __at(0x2EA);
// bitfield macros
#define _U4UIR_ABDIE_POSN                                   0x2
#define _U4UIR_ABDIE_POSITION                               0x2
#define _U4UIR_ABDIE_SIZE                                   0x1
#define _U4UIR_ABDIE_LENGTH                                 0x1
#define _U4UIR_ABDIE_MASK                                   0x4
#define _U4UIR_ABDIF_POSN                                   0x6
#define _U4UIR_ABDIF_POSITION                               0x6
#define _U4UIR_ABDIF_SIZE                                   0x1
#define _U4UIR_ABDIF_LENGTH                                 0x1
#define _U4UIR_ABDIF_MASK                                   0x40
#define _U4UIR_WUIF_POSN                                    0x7
#define _U4UIR_WUIF_POSITION                                0x7
#define _U4UIR_WUIF_SIZE                                    0x1
#define _U4UIR_WUIF_LENGTH                                  0x1
#define _U4UIR_WUIF_MASK                                    0x80
#define _U4UIR_U4ABDIE_POSN                                 0x2
#define _U4UIR_U4ABDIE_POSITION                             0x2
#define _U4UIR_U4ABDIE_SIZE                                 0x1
#define _U4UIR_U4ABDIE_LENGTH                               0x1
#define _U4UIR_U4ABDIE_MASK                                 0x4
#define _U4UIR_U4ABDIF_POSN                                 0x6
#define _U4UIR_U4ABDIF_POSITION                             0x6
#define _U4UIR_U4ABDIF_SIZE                                 0x1
#define _U4UIR_U4ABDIF_LENGTH                               0x1
#define _U4UIR_U4ABDIF_MASK                                 0x40
#define _U4UIR_U4WUIF_POSN                                  0x7
#define _U4UIR_U4WUIF_POSITION                              0x7
#define _U4UIR_U4WUIF_SIZE                                  0x1
#define _U4UIR_U4WUIF_LENGTH                                0x1
#define _U4UIR_U4WUIF_MASK                                  0x80

// Register: U4ERRIR
#define U4ERRIR U4ERRIR
extern volatile unsigned char           U4ERRIR             __at(0x2EB);
#ifndef _LIB_BUILD
asm("U4ERRIR equ 02EBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U4TXCIF                :1;
        unsigned U4RXFOIF               :1;
        unsigned U4RXBKIF               :1;
        unsigned U4FERIF                :1;
        unsigned U4CERIF                :1;
        unsigned U4ABDOVF               :1;
        unsigned U4PERIF                :1;
        unsigned U4TXMTIF               :1;
    };
} U4ERRIRbits_t;
extern volatile U4ERRIRbits_t U4ERRIRbits __at(0x2EB);
// bitfield macros
#define _U4ERRIR_TXCIF_POSN                                 0x0
#define _U4ERRIR_TXCIF_POSITION                             0x0
#define _U4ERRIR_TXCIF_SIZE                                 0x1
#define _U4ERRIR_TXCIF_LENGTH                               0x1
#define _U4ERRIR_TXCIF_MASK                                 0x1
#define _U4ERRIR_RXFOIF_POSN                                0x1
#define _U4ERRIR_RXFOIF_POSITION                            0x1
#define _U4ERRIR_RXFOIF_SIZE                                0x1
#define _U4ERRIR_RXFOIF_LENGTH                              0x1
#define _U4ERRIR_RXFOIF_MASK                                0x2
#define _U4ERRIR_RXBKIF_POSN                                0x2
#define _U4ERRIR_RXBKIF_POSITION                            0x2
#define _U4ERRIR_RXBKIF_SIZE                                0x1
#define _U4ERRIR_RXBKIF_LENGTH                              0x1
#define _U4ERRIR_RXBKIF_MASK                                0x4
#define _U4ERRIR_FERIF_POSN                                 0x3
#define _U4ERRIR_FERIF_POSITION                             0x3
#define _U4ERRIR_FERIF_SIZE                                 0x1
#define _U4ERRIR_FERIF_LENGTH                               0x1
#define _U4ERRIR_FERIF_MASK                                 0x8
#define _U4ERRIR_CERIF_POSN                                 0x4
#define _U4ERRIR_CERIF_POSITION                             0x4
#define _U4ERRIR_CERIF_SIZE                                 0x1
#define _U4ERRIR_CERIF_LENGTH                               0x1
#define _U4ERRIR_CERIF_MASK                                 0x10
#define _U4ERRIR_ABDOVF_POSN                                0x5
#define _U4ERRIR_ABDOVF_POSITION                            0x5
#define _U4ERRIR_ABDOVF_SIZE                                0x1
#define _U4ERRIR_ABDOVF_LENGTH                              0x1
#define _U4ERRIR_ABDOVF_MASK                                0x20
#define _U4ERRIR_PERIF_POSN                                 0x6
#define _U4ERRIR_PERIF_POSITION                             0x6
#define _U4ERRIR_PERIF_SIZE                                 0x1
#define _U4ERRIR_PERIF_LENGTH                               0x1
#define _U4ERRIR_PERIF_MASK                                 0x40
#define _U4ERRIR_TXMTIF_POSN                                0x7
#define _U4ERRIR_TXMTIF_POSITION                            0x7
#define _U4ERRIR_TXMTIF_SIZE                                0x1
#define _U4ERRIR_TXMTIF_LENGTH                              0x1
#define _U4ERRIR_TXMTIF_MASK                                0x80
#define _U4ERRIR_U4TXCIF_POSN                               0x0
#define _U4ERRIR_U4TXCIF_POSITION                           0x0
#define _U4ERRIR_U4TXCIF_SIZE                               0x1
#define _U4ERRIR_U4TXCIF_LENGTH                             0x1
#define _U4ERRIR_U4TXCIF_MASK                               0x1
#define _U4ERRIR_U4RXFOIF_POSN                              0x1
#define _U4ERRIR_U4RXFOIF_POSITION                          0x1
#define _U4ERRIR_U4RXFOIF_SIZE                              0x1
#define _U4ERRIR_U4RXFOIF_LENGTH                            0x1
#define _U4ERRIR_U4RXFOIF_MASK                              0x2
#define _U4ERRIR_U4RXBKIF_POSN                              0x2
#define _U4ERRIR_U4RXBKIF_POSITION                          0x2
#define _U4ERRIR_U4RXBKIF_SIZE                              0x1
#define _U4ERRIR_U4RXBKIF_LENGTH                            0x1
#define _U4ERRIR_U4RXBKIF_MASK                              0x4
#define _U4ERRIR_U4FERIF_POSN                               0x3
#define _U4ERRIR_U4FERIF_POSITION                           0x3
#define _U4ERRIR_U4FERIF_SIZE                               0x1
#define _U4ERRIR_U4FERIF_LENGTH                             0x1
#define _U4ERRIR_U4FERIF_MASK                               0x8
#define _U4ERRIR_U4CERIF_POSN                               0x4
#define _U4ERRIR_U4CERIF_POSITION                           0x4
#define _U4ERRIR_U4CERIF_SIZE                               0x1
#define _U4ERRIR_U4CERIF_LENGTH                             0x1
#define _U4ERRIR_U4CERIF_MASK                               0x10
#define _U4ERRIR_U4ABDOVF_POSN                              0x5
#define _U4ERRIR_U4ABDOVF_POSITION                          0x5
#define _U4ERRIR_U4ABDOVF_SIZE                              0x1
#define _U4ERRIR_U4ABDOVF_LENGTH                            0x1
#define _U4ERRIR_U4ABDOVF_MASK                              0x20
#define _U4ERRIR_U4PERIF_POSN                               0x6
#define _U4ERRIR_U4PERIF_POSITION                           0x6
#define _U4ERRIR_U4PERIF_SIZE                               0x1
#define _U4ERRIR_U4PERIF_LENGTH                             0x1
#define _U4ERRIR_U4PERIF_MASK                               0x40
#define _U4ERRIR_U4TXMTIF_POSN                              0x7
#define _U4ERRIR_U4TXMTIF_POSITION                          0x7
#define _U4ERRIR_U4TXMTIF_SIZE                              0x1
#define _U4ERRIR_U4TXMTIF_LENGTH                            0x1
#define _U4ERRIR_U4TXMTIF_MASK                              0x80

