MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
// Register: NCO2INCU
#define NCO2INCU NCO2INCU
extern volatile unsigned char           NCO2INCU            __at(0x44D);
#ifndef _LIB_BUILD
asm("NCO2INCU equ 044Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :4;
    };
    struct {
        unsigned NCO2INC16              :1;
        unsigned NCO2INC17              :1;
        unsigned NCO2INC18              :1;
        unsigned NCO2INC19              :1;
    };
    struct {
        unsigned INC16                  :1;
        unsigned INC17                  :1;
        unsigned INC18                  :1;
        unsigned INC19                  :1;
    };
    struct {
        unsigned NCO2INC                :4;
    };
} NCO2INCUbits_t;
extern volatile NCO2INCUbits_t NCO2INCUbits __at(0x44D);
// bitfield macros
#define _NCO2INCU_INC_POSN                                  0x0
#define _NCO2INCU_INC_POSITION                              0x0
#define _NCO2INCU_INC_SIZE                                  0x4
#define _NCO2INCU_INC_LENGTH                                0x4
#define _NCO2INCU_INC_MASK                                  0xF
#define _NCO2INCU_NCO2INC16_POSN                            0x0
#define _NCO2INCU_NCO2INC16_POSITION                        0x0
#define _NCO2INCU_NCO2INC16_SIZE                            0x1
#define _NCO2INCU_NCO2INC16_LENGTH                          0x1
#define _NCO2INCU_NCO2INC16_MASK                            0x1
#define _NCO2INCU_NCO2INC17_POSN                            0x1
#define _NCO2INCU_NCO2INC17_POSITION                        0x1
#define _NCO2INCU_NCO2INC17_SIZE                            0x1
#define _NCO2INCU_NCO2INC17_LENGTH                          0x1
#define _NCO2INCU_NCO2INC17_MASK                            0x2
#define _NCO2INCU_NCO2INC18_POSN                            0x2
#define _NCO2INCU_NCO2INC18_POSITION                        0x2
#define _NCO2INCU_NCO2INC18_SIZE                            0x1
#define _NCO2INCU_NCO2INC18_LENGTH                          0x1
#define _NCO2INCU_NCO2INC18_MASK                            0x4
#define _NCO2INCU_NCO2INC19_POSN                            0x3
#define _NCO2INCU_NCO2INC19_POSITION                        0x3
#define _NCO2INCU_NCO2INC19_SIZE                            0x1
#define _NCO2INCU_NCO2INC19_LENGTH                          0x1
#define _NCO2INCU_NCO2INC19_MASK                            0x8
#define _NCO2INCU_INC16_POSN                                0x0
#define _NCO2INCU_INC16_POSITION                            0x0
#define _NCO2INCU_INC16_SIZE                                0x1
#define _NCO2INCU_INC16_LENGTH                              0x1
#define _NCO2INCU_INC16_MASK                                0x1
#define _NCO2INCU_INC17_POSN                                0x1
#define _NCO2INCU_INC17_POSITION                            0x1
#define _NCO2INCU_INC17_SIZE                                0x1
#define _NCO2INCU_INC17_LENGTH                              0x1
#define _NCO2INCU_INC17_MASK                                0x2
#define _NCO2INCU_INC18_POSN                                0x2
#define _NCO2INCU_INC18_POSITION                            0x2
#define _NCO2INCU_INC18_SIZE                                0x1
#define _NCO2INCU_INC18_LENGTH                              0x1
#define _NCO2INCU_INC18_MASK                                0x4
#define _NCO2INCU_INC19_POSN                                0x3
#define _NCO2INCU_INC19_POSITION                            0x3
#define _NCO2INCU_INC19_SIZE                                0x1
#define _NCO2INCU_INC19_LENGTH                              0x1
#define _NCO2INCU_INC19_MASK                                0x8
#define _NCO2INCU_NCO2INC_POSN                              0x0
#define _NCO2INCU_NCO2INC_POSITION                          0x0
#define _NCO2INCU_NCO2INC_SIZE                              0x4
#define _NCO2INCU_NCO2INC_LENGTH                            0x4
#define _NCO2INCU_NCO2INC_MASK                              0xF

// Register: NCO2CON
#define NCO2CON NCO2CON
extern volatile unsigned char           NCO2CON             __at(0x44E);
#ifndef _LIB_BUILD
asm("NCO2CON equ 044Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PFM                    :1;
        unsigned                        :3;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NCO2PFM                :1;
        unsigned                        :3;
        unsigned NCO2POL                :1;
        unsigned NCO2OUT                :1;
        unsigned                        :1;
        unsigned NCO2EN                 :1;
    };
} NCO2CONbits_t;
extern volatile NCO2CONbits_t NCO2CONbits __at(0x44E);
// bitfield macros
#define _NCO2CON_PFM_POSN                                   0x0
#define _NCO2CON_PFM_POSITION                               0x0
#define _NCO2CON_PFM_SIZE                                   0x1
#define _NCO2CON_PFM_LENGTH                                 0x1
#define _NCO2CON_PFM_MASK                                   0x1
#define _NCO2CON_POL_POSN                                   0x4
#define _NCO2CON_POL_POSITION                               0x4
#define _NCO2CON_POL_SIZE                                   0x1
#define _NCO2CON_POL_LENGTH                                 0x1
#define _NCO2CON_POL_MASK                                   0x10
#define _NCO2CON_OUT_POSN                                   0x5
#define _NCO2CON_OUT_POSITION                               0x5
#define _NCO2CON_OUT_SIZE                                   0x1
#define _NCO2CON_OUT_LENGTH                                 0x1
#define _NCO2CON_OUT_MASK                                   0x20
#define _NCO2CON_EN_POSN                                    0x7
#define _NCO2CON_EN_POSITION                                0x7
#define _NCO2CON_EN_SIZE                                    0x1
#define _NCO2CON_EN_LENGTH                                  0x1
#define _NCO2CON_EN_MASK                                    0x80
#define _NCO2CON_NCO2PFM_POSN                               0x0
#define _NCO2CON_NCO2PFM_POSITION                           0x0
#define _NCO2CON_NCO2PFM_SIZE                               0x1
#define _NCO2CON_NCO2PFM_LENGTH                             0x1
#define _NCO2CON_NCO2PFM_MASK                               0x1
#define _NCO2CON_NCO2POL_POSN                               0x4
#define _NCO2CON_NCO2POL_POSITION                           0x4
#define _NCO2CON_NCO2POL_SIZE                               0x1
#define _NCO2CON_NCO2POL_LENGTH                             0x1
#define _NCO2CON_NCO2POL_MASK                               0x10
#define _NCO2CON_NCO2OUT_POSN                               0x5
#define _NCO2CON_NCO2OUT_POSITION                           0x5
#define _NCO2CON_NCO2OUT_SIZE                               0x1
#define _NCO2CON_NCO2OUT_LENGTH                             0x1
#define _NCO2CON_NCO2OUT_MASK                               0x20
#define _NCO2CON_NCO2EN_POSN                                0x7
#define _NCO2CON_NCO2EN_POSITION                            0x7
#define _NCO2CON_NCO2EN_SIZE                                0x1
#define _NCO2CON_NCO2EN_LENGTH                              0x1
#define _NCO2CON_NCO2EN_MASK                                0x80

// Register: NCO2CLK
#define NCO2CLK NCO2CLK
extern volatile unsigned char           NCO2CLK             __at(0x44F);
#ifndef _LIB_BUILD
asm("NCO2CLK equ 044Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :5;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned CKS4                   :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO2CKS                :5;
        unsigned NCO2PWS                :3;
    };
    struct {
        unsigned NCO2CKS0               :1;
        unsigned NCO2CKS1               :1;
        unsigned NCO2CKS2               :1;
        unsigned NCO2CKS3               :1;
        unsigned NCO2CKS4               :1;
        unsigned NCO2PWS0               :1;
        unsigned NCO2PWS1               :1;
        unsigned NCO2PWS2               :1;
    };
} NCO2CLKbits_t;
extern volatile NCO2CLKbits_t NCO2CLKbits __at(0x44F);
// bitfield macros
#define _NCO2CLK_CKS_POSN                                   0x0
#define _NCO2CLK_CKS_POSITION                               0x0
#define _NCO2CLK_CKS_SIZE                                   0x5
#define _NCO2CLK_CKS_LENGTH                                 0x5
#define _NCO2CLK_CKS_MASK                                   0x1F
#define _NCO2CLK_PWS_POSN                                   0x5
#define _NCO2CLK_PWS_POSITION                               0x5
#define _NCO2CLK_PWS_SIZE                                   0x3
#define _NCO2CLK_PWS_LENGTH                                 0x3
#define _NCO2CLK_PWS_MASK                                   0xE0
#define _NCO2CLK_CKS0_POSN                                  0x0
#define _NCO2CLK_CKS0_POSITION                              0x0
#define _NCO2CLK_CKS0_SIZE                                  0x1
#define _NCO2CLK_CKS0_LENGTH                                0x1
#define _NCO2CLK_CKS0_MASK                                  0x1
#define _NCO2CLK_CKS1_POSN                                  0x1
#define _NCO2CLK_CKS1_POSITION                              0x1
#define _NCO2CLK_CKS1_SIZE                                  0x1
#define _NCO2CLK_CKS1_LENGTH                                0x1
#define _NCO2CLK_CKS1_MASK                                  0x2
#define _NCO2CLK_CKS2_POSN                                  0x2
#define _NCO2CLK_CKS2_POSITION                              0x2
#define _NCO2CLK_CKS2_SIZE                                  0x1
#define _NCO2CLK_CKS2_LENGTH                                0x1
#define _NCO2CLK_CKS2_MASK                                  0x4
#define _NCO2CLK_CKS3_POSN                                  0x3
#define _NCO2CLK_CKS3_POSITION                              0x3
#define _NCO2CLK_CKS3_SIZE                                  0x1
#define _NCO2CLK_CKS3_LENGTH                                0x1
#define _NCO2CLK_CKS3_MASK                                  0x8
#define _NCO2CLK_CKS4_POSN                                  0x4
#define _NCO2CLK_CKS4_POSITION                              0x4
#define _NCO2CLK_CKS4_SIZE                                  0x1
#define _NCO2CLK_CKS4_LENGTH                                0x1
#define _NCO2CLK_CKS4_MASK                                  0x10
#define _NCO2CLK_PWS0_POSN                                  0x5
#define _NCO2CLK_PWS0_POSITION                              0x5
#define _NCO2CLK_PWS0_SIZE                                  0x1
#define _NCO2CLK_PWS0_LENGTH                                0x1
#define _NCO2CLK_PWS0_MASK                                  0x20
#define _NCO2CLK_PWS1_POSN                                  0x6
#define _NCO2CLK_PWS1_POSITION                              0x6
#define _NCO2CLK_PWS1_SIZE                                  0x1
#define _NCO2CLK_PWS1_LENGTH                                0x1
#define _NCO2CLK_PWS1_MASK                                  0x40
#define _NCO2CLK_PWS2_POSN                                  0x7
#define _NCO2CLK_PWS2_POSITION                              0x7
#define _NCO2CLK_PWS2_SIZE                                  0x1
#define _NCO2CLK_PWS2_LENGTH                                0x1
#define _NCO2CLK_PWS2_MASK                                  0x80
#define _NCO2CLK_NCO2CKS_POSN                               0x0
#define _NCO2CLK_NCO2CKS_POSITION                           0x0
#define _NCO2CLK_NCO2CKS_SIZE                               0x5
#define _NCO2CLK_NCO2CKS_LENGTH                             0x5
#define _NCO2CLK_NCO2CKS_MASK                               0x1F
#define _NCO2CLK_NCO2PWS_POSN                               0x5
#define _NCO2CLK_NCO2PWS_POSITION                           0x5
#define _NCO2CLK_NCO2PWS_SIZE                               0x3
#define _NCO2CLK_NCO2PWS_LENGTH                             0x3
#define _NCO2CLK_NCO2PWS_MASK                               0xE0
#define _NCO2CLK_NCO2CKS0_POSN                              0x0
#define _NCO2CLK_NCO2CKS0_POSITION                          0x0
#define _NCO2CLK_NCO2CKS0_SIZE                              0x1
#define _NCO2CLK_NCO2CKS0_LENGTH                            0x1
#define _NCO2CLK_NCO2CKS0_MASK                              0x1
#define _NCO2CLK_NCO2CKS1_POSN                              0x1
#define _NCO2CLK_NCO2CKS1_POSITION                          0x1
#define _NCO2CLK_NCO2CKS1_SIZE                              0x1
#define _NCO2CLK_NCO2CKS1_LENGTH                            0x1
#define _NCO2CLK_NCO2CKS1_MASK                              0x2
#define _NCO2CLK_NCO2CKS2_POSN                              0x2
#define _NCO2CLK_NCO2CKS2_POSITION                          0x2
#define _NCO2CLK_NCO2CKS2_SIZE                              0x1
#define _NCO2CLK_NCO2CKS2_LENGTH                            0x1
#define _NCO2CLK_NCO2CKS2_MASK                              0x4
#define _NCO2CLK_NCO2CKS3_POSN                              0x3
#define _NCO2CLK_NCO2CKS3_POSITION                          0x3
#define _NCO2CLK_NCO2CKS3_SIZE                              0x1
#define _NCO2CLK_NCO2CKS3_LENGTH                            0x1
#define _NCO2CLK_NCO2CKS3_MASK                              0x8
#define _NCO2CLK_NCO2CKS4_POSN                              0x4
#define _NCO2CLK_NCO2CKS4_POSITION                          0x4
#define _NCO2CLK_NCO2CKS4_SIZE                              0x1
#define _NCO2CLK_NCO2CKS4_LENGTH                            0x1
#define _NCO2CLK_NCO2CKS4_MASK                              0x10
#define _NCO2CLK_NCO2PWS0_POSN                              0x5
#define _NCO2CLK_NCO2PWS0_POSITION                          0x5
#define _NCO2CLK_NCO2PWS0_SIZE                              0x1
#define _NCO2CLK_NCO2PWS0_LENGTH                            0x1
#define _NCO2CLK_NCO2PWS0_MASK                              0x20
#define _NCO2CLK_NCO2PWS1_POSN                              0x6
#define _NCO2CLK_NCO2PWS1_POSITION                          0x6
#define _NCO2CLK_NCO2PWS1_SIZE                              0x1
#define _NCO2CLK_NCO2PWS1_LENGTH                            0x1
#define _NCO2CLK_NCO2PWS1_MASK                              0x40
#define _NCO2CLK_NCO2PWS2_POSN                              0x7
#define _NCO2CLK_NCO2PWS2_POSITION                          0x7
#define _NCO2CLK_NCO2PWS2_SIZE                              0x1
#define _NCO2CLK_NCO2PWS2_LENGTH                            0x1
#define _NCO2CLK_NCO2PWS2_MASK                              0x80

