MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
// Register: PWM1S1P1H
#define PWM1S1P1H PWM1S1P1H
extern volatile unsigned char           PWM1S1P1H           __at(0x46C);
#ifndef _LIB_BUILD
asm("PWM1S1P1H equ 046Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1H                  :8;
    };
} PWM1S1P1Hbits_t;
extern volatile PWM1S1P1Hbits_t PWM1S1P1Hbits __at(0x46C);
// bitfield macros
#define _PWM1S1P1H_S1P1H_POSN                               0x0
#define _PWM1S1P1H_S1P1H_POSITION                           0x0
#define _PWM1S1P1H_S1P1H_SIZE                               0x8
#define _PWM1S1P1H_S1P1H_LENGTH                             0x8
#define _PWM1S1P1H_S1P1H_MASK                               0xFF

// Register: PWM1S1P2
#define PWM1S1P2 PWM1S1P2
extern volatile unsigned short          PWM1S1P2            __at(0x46D);
#ifndef _LIB_BUILD
asm("PWM1S1P2 equ 046Dh");
#endif

// Register: PWM1S1P2L
#define PWM1S1P2L PWM1S1P2L
extern volatile unsigned char           PWM1S1P2L           __at(0x46D);
#ifndef _LIB_BUILD
asm("PWM1S1P2L equ 046Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2L                  :8;
    };
} PWM1S1P2Lbits_t;
extern volatile PWM1S1P2Lbits_t PWM1S1P2Lbits __at(0x46D);
// bitfield macros
#define _PWM1S1P2L_S1P2L_POSN                               0x0
#define _PWM1S1P2L_S1P2L_POSITION                           0x0
#define _PWM1S1P2L_S1P2L_SIZE                               0x8
#define _PWM1S1P2L_S1P2L_LENGTH                             0x8
#define _PWM1S1P2L_S1P2L_MASK                               0xFF

// Register: PWM1S1P2H
#define PWM1S1P2H PWM1S1P2H
extern volatile unsigned char           PWM1S1P2H           __at(0x46E);
#ifndef _LIB_BUILD
asm("PWM1S1P2H equ 046Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P2H                  :8;
    };
} PWM1S1P2Hbits_t;
extern volatile PWM1S1P2Hbits_t PWM1S1P2Hbits __at(0x46E);
// bitfield macros
#define _PWM1S1P2H_S1P2H_POSN                               0x0
#define _PWM1S1P2H_S1P2H_POSITION                           0x0
#define _PWM1S1P2H_S1P2H_SIZE                               0x8
#define _PWM1S1P2H_S1P2H_LENGTH                             0x8
#define _PWM1S1P2H_S1P2H_MASK                               0xFF

// Register: PWM2ERS
#define PWM2ERS PWM2ERS
extern volatile unsigned char           PWM2ERS             __at(0x46F);
#ifndef _LIB_BUILD
asm("PWM2ERS equ 046Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
        unsigned ERS5                   :1;
        unsigned ERS6                   :1;
        unsigned ERS7                   :1;
    };
} PWM2ERSbits_t;
extern volatile PWM2ERSbits_t PWM2ERSbits __at(0x46F);
// bitfield macros
#define _PWM2ERS_ERS_POSN                                   0x0
#define _PWM2ERS_ERS_POSITION                               0x0
#define _PWM2ERS_ERS_SIZE                                   0x8
#define _PWM2ERS_ERS_LENGTH                                 0x8
#define _PWM2ERS_ERS_MASK                                   0xFF
#define _PWM2ERS_ERS0_POSN                                  0x0
#define _PWM2ERS_ERS0_POSITION                              0x0
#define _PWM2ERS_ERS0_SIZE                                  0x1
#define _PWM2ERS_ERS0_LENGTH                                0x1
#define _PWM2ERS_ERS0_MASK                                  0x1
#define _PWM2ERS_ERS1_POSN                                  0x1
#define _PWM2ERS_ERS1_POSITION                              0x1
#define _PWM2ERS_ERS1_SIZE                                  0x1
#define _PWM2ERS_ERS1_LENGTH                                0x1
#define _PWM2ERS_ERS1_MASK                                  0x2
#define _PWM2ERS_ERS2_POSN                                  0x2
#define _PWM2ERS_ERS2_POSITION                              0x2
#define _PWM2ERS_ERS2_SIZE                                  0x1
#define _PWM2ERS_ERS2_LENGTH                                0x1
#define _PWM2ERS_ERS2_MASK                                  0x4
#define _PWM2ERS_ERS3_POSN                                  0x3
#define _PWM2ERS_ERS3_POSITION                              0x3
#define _PWM2ERS_ERS3_SIZE                                  0x1
#define _PWM2ERS_ERS3_LENGTH                                0x1
#define _PWM2ERS_ERS3_MASK                                  0x8
#define _PWM2ERS_ERS4_POSN                                  0x4
#define _PWM2ERS_ERS4_POSITION                              0x4
#define _PWM2ERS_ERS4_SIZE                                  0x1
#define _PWM2ERS_ERS4_LENGTH                                0x1
#define _PWM2ERS_ERS4_MASK                                  0x10
#define _PWM2ERS_ERS5_POSN                                  0x5
#define _PWM2ERS_ERS5_POSITION                              0x5
#define _PWM2ERS_ERS5_SIZE                                  0x1
#define _PWM2ERS_ERS5_LENGTH                                0x1
#define _PWM2ERS_ERS5_MASK                                  0x20
#define _PWM2ERS_ERS6_POSN                                  0x6
#define _PWM2ERS_ERS6_POSITION                              0x6
#define _PWM2ERS_ERS6_SIZE                                  0x1
#define _PWM2ERS_ERS6_LENGTH                                0x1
#define _PWM2ERS_ERS6_MASK                                  0x40
#define _PWM2ERS_ERS7_POSN                                  0x7
#define _PWM2ERS_ERS7_POSITION                              0x7
#define _PWM2ERS_ERS7_SIZE                                  0x1
#define _PWM2ERS_ERS7_LENGTH                                0x1
#define _PWM2ERS_ERS7_MASK                                  0x80

// Register: PWM2CLK
#define PWM2CLK PWM2CLK
extern volatile unsigned char           PWM2CLK             __at(0x470);
#ifndef _LIB_BUILD
asm("PWM2CLK equ 0470h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
        unsigned CLK5                   :1;
        unsigned CLK6                   :1;
        unsigned CLK7                   :1;
    };
} PWM2CLKbits_t;
extern volatile PWM2CLKbits_t PWM2CLKbits __at(0x470);
// bitfield macros
#define _PWM2CLK_CLK_POSN                                   0x0
#define _PWM2CLK_CLK_POSITION                               0x0
#define _PWM2CLK_CLK_SIZE                                   0x8
#define _PWM2CLK_CLK_LENGTH                                 0x8
#define _PWM2CLK_CLK_MASK                                   0xFF
#define _PWM2CLK_CLK0_POSN                                  0x0
#define _PWM2CLK_CLK0_POSITION                              0x0
#define _PWM2CLK_CLK0_SIZE                                  0x1
#define _PWM2CLK_CLK0_LENGTH                                0x1
#define _PWM2CLK_CLK0_MASK                                  0x1
#define _PWM2CLK_CLK1_POSN                                  0x1
#define _PWM2CLK_CLK1_POSITION                              0x1
#define _PWM2CLK_CLK1_SIZE                                  0x1
#define _PWM2CLK_CLK1_LENGTH                                0x1
#define _PWM2CLK_CLK1_MASK                                  0x2
#define _PWM2CLK_CLK2_POSN                                  0x2
#define _PWM2CLK_CLK2_POSITION                              0x2
#define _PWM2CLK_CLK2_SIZE                                  0x1
#define _PWM2CLK_CLK2_LENGTH                                0x1
#define _PWM2CLK_CLK2_MASK                                  0x4
#define _PWM2CLK_CLK3_POSN                                  0x3
#define _PWM2CLK_CLK3_POSITION                              0x3
#define _PWM2CLK_CLK3_SIZE                                  0x1
#define _PWM2CLK_CLK3_LENGTH                                0x1
#define _PWM2CLK_CLK3_MASK                                  0x8
#define _PWM2CLK_CLK4_POSN                                  0x4
#define _PWM2CLK_CLK4_POSITION                              0x4
#define _PWM2CLK_CLK4_SIZE                                  0x1
#define _PWM2CLK_CLK4_LENGTH                                0x1
#define _PWM2CLK_CLK4_MASK                                  0x10
#define _PWM2CLK_CLK5_POSN                                  0x5
#define _PWM2CLK_CLK5_POSITION                              0x5
#define _PWM2CLK_CLK5_SIZE                                  0x1
#define _PWM2CLK_CLK5_LENGTH                                0x1
#define _PWM2CLK_CLK5_MASK                                  0x20
#define _PWM2CLK_CLK6_POSN                                  0x6
#define _PWM2CLK_CLK6_POSITION                              0x6
#define _PWM2CLK_CLK6_SIZE                                  0x1
#define _PWM2CLK_CLK6_LENGTH                                0x1
#define _PWM2CLK_CLK6_MASK                                  0x40
#define _PWM2CLK_CLK7_POSN                                  0x7
#define _PWM2CLK_CLK7_POSITION                              0x7
#define _PWM2CLK_CLK7_SIZE                                  0x1
#define _PWM2CLK_CLK7_LENGTH                                0x1
#define _PWM2CLK_CLK7_MASK                                  0x80

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
extern volatile unsigned char           PWM2LDS             __at(0x471);
#ifndef _LIB_BUILD
asm("PWM2LDS equ 0471h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
        unsigned LDS3                   :1;
        unsigned LDS4                   :1;
        unsigned LDS5                   :1;
        unsigned LDS6                   :1;
        unsigned LDS7                   :1;
    };
} PWM2LDSbits_t;
extern volatile PWM2LDSbits_t PWM2LDSbits __at(0x471);
// bitfield macros
#define _PWM2LDS_LDS_POSN                                   0x0
#define _PWM2LDS_LDS_POSITION                               0x0
#define _PWM2LDS_LDS_SIZE                                   0x8
#define _PWM2LDS_LDS_LENGTH                                 0x8
#define _PWM2LDS_LDS_MASK                                   0xFF
#define _PWM2LDS_LDS0_POSN                                  0x0
#define _PWM2LDS_LDS0_POSITION                              0x0
#define _PWM2LDS_LDS0_SIZE                                  0x1
#define _PWM2LDS_LDS0_LENGTH                                0x1
#define _PWM2LDS_LDS0_MASK                                  0x1
#define _PWM2LDS_LDS1_POSN                                  0x1
#define _PWM2LDS_LDS1_POSITION                              0x1
#define _PWM2LDS_LDS1_SIZE                                  0x1
#define _PWM2LDS_LDS1_LENGTH                                0x1
#define _PWM2LDS_LDS1_MASK                                  0x2
#define _PWM2LDS_LDS2_POSN                                  0x2
#define _PWM2LDS_LDS2_POSITION                              0x2
#define _PWM2LDS_LDS2_SIZE                                  0x1
#define _PWM2LDS_LDS2_LENGTH                                0x1
#define _PWM2LDS_LDS2_MASK                                  0x4
#define _PWM2LDS_LDS3_POSN                                  0x3
#define _PWM2LDS_LDS3_POSITION                              0x3
#define _PWM2LDS_LDS3_SIZE                                  0x1
#define _PWM2LDS_LDS3_LENGTH                                0x1
#define _PWM2LDS_LDS3_MASK                                  0x8
#define _PWM2LDS_LDS4_POSN                                  0x4
#define _PWM2LDS_LDS4_POSITION                              0x4
#define _PWM2LDS_LDS4_SIZE                                  0x1
#define _PWM2LDS_LDS4_LENGTH                                0x1
#define _PWM2LDS_LDS4_MASK                                  0x10
#define _PWM2LDS_LDS5_POSN                                  0x5
#define _PWM2LDS_LDS5_POSITION                              0x5
#define _PWM2LDS_LDS5_SIZE                                  0x1
#define _PWM2LDS_LDS5_LENGTH                                0x1
#define _PWM2LDS_LDS5_MASK                                  0x20
#define _PWM2LDS_LDS6_POSN                                  0x6
#define _PWM2LDS_LDS6_POSITION                              0x6
#define _PWM2LDS_LDS6_SIZE                                  0x1
#define _PWM2LDS_LDS6_LENGTH                                0x1
#define _PWM2LDS_LDS6_MASK                                  0x40
#define _PWM2LDS_LDS7_POSN                                  0x7
#define _PWM2LDS_LDS7_POSITION                              0x7
#define _PWM2LDS_LDS7_SIZE                                  0x1
#define _PWM2LDS_LDS7_LENGTH                                0x1
#define _PWM2LDS_LDS7_MASK                                  0x80

// Register: PWM2PR
#define PWM2PR PWM2PR
extern volatile unsigned short          PWM2PR              __at(0x472);
#ifndef _LIB_BUILD
asm("PWM2PR equ 0472h");
#endif

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
extern volatile unsigned char           PWM2PRL             __at(0x472);
#ifndef _LIB_BUILD
asm("PWM2PRL equ 0472h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM2PRLbits_t;
extern volatile PWM2PRLbits_t PWM2PRLbits __at(0x472);
// bitfield macros
#define _PWM2PRL_PRL_POSN                                   0x0
#define _PWM2PRL_PRL_POSITION                               0x0
#define _PWM2PRL_PRL_SIZE                                   0x8
#define _PWM2PRL_PRL_LENGTH                                 0x8
#define _PWM2PRL_PRL_MASK                                   0xFF

