MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
#define                                 AOV_bit             _BIT_ACCESS(ADSTAT,7)
// SMT1STAT<AS>
extern volatile __bit                   AS                  __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 AS_bit              _BIT_ACCESS(SMT1STAT,0)
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 ASYNC_bit           _BIT_ACCESS(T0CON1,4)
// IVTBASEL<BASE0>
extern volatile __bit                   BASE0               __at(0x22E8);	// @ (0x45D * 8 + 0)
#define                                 BASE0_bit           _BIT_ACCESS(IVTBASEL,0)
// IVTBASEL<BASE1>
extern volatile __bit                   BASE1               __at(0x22E9);	// @ (0x45D * 8 + 1)
#define                                 BASE1_bit           _BIT_ACCESS(IVTBASEL,1)
// IVTBASEH<BASE10>
extern volatile __bit                   BASE10              __at(0x22F2);	// @ (0x45E * 8 + 2)
#define                                 BASE10_bit          _BIT_ACCESS(IVTBASEH,2)
// IVTBASEH<BASE11>
extern volatile __bit                   BASE11              __at(0x22F3);	// @ (0x45E * 8 + 3)
#define                                 BASE11_bit          _BIT_ACCESS(IVTBASEH,3)
// IVTBASEH<BASE12>
extern volatile __bit                   BASE12              __at(0x22F4);	// @ (0x45E * 8 + 4)
#define                                 BASE12_bit          _BIT_ACCESS(IVTBASEH,4)
// IVTBASEH<BASE13>
extern volatile __bit                   BASE13              __at(0x22F5);	// @ (0x45E * 8 + 5)
#define                                 BASE13_bit          _BIT_ACCESS(IVTBASEH,5)
// IVTBASEH<BASE14>
extern volatile __bit                   BASE14              __at(0x22F6);	// @ (0x45E * 8 + 6)
#define                                 BASE14_bit          _BIT_ACCESS(IVTBASEH,6)
// IVTBASEH<BASE15>
extern volatile __bit                   BASE15              __at(0x22F7);	// @ (0x45E * 8 + 7)
#define                                 BASE15_bit          _BIT_ACCESS(IVTBASEH,7)
// IVTBASEU<BASE16>
extern volatile __bit                   BASE16              __at(0x22F8);	// @ (0x45F * 8 + 0)
#define                                 BASE16_bit          _BIT_ACCESS(IVTBASEU,0)
// IVTBASEU<BASE17>
extern volatile __bit                   BASE17              __at(0x22F9);	// @ (0x45F * 8 + 1)
#define                                 BASE17_bit          _BIT_ACCESS(IVTBASEU,1)
// IVTBASEU<BASE18>
extern volatile __bit                   BASE18              __at(0x22FA);	// @ (0x45F * 8 + 2)
#define                                 BASE18_bit          _BIT_ACCESS(IVTBASEU,2)
// IVTBASEU<BASE19>
extern volatile __bit                   BASE19              __at(0x22FB);	// @ (0x45F * 8 + 3)
#define                                 BASE19_bit          _BIT_ACCESS(IVTBASEU,3)
// IVTBASEL<BASE2>
extern volatile __bit                   BASE2               __at(0x22EA);	// @ (0x45D * 8 + 2)
#define                                 BASE2_bit           _BIT_ACCESS(IVTBASEL,2)
// IVTBASEU<BASE20>
extern volatile __bit                   BASE20              __at(0x22FC);	// @ (0x45F * 8 + 4)
#define                                 BASE20_bit          _BIT_ACCESS(IVTBASEU,4)
// IVTBASEL<BASE3>
extern volatile __bit                   BASE3               __at(0x22EB);	// @ (0x45D * 8 + 3)
#define                                 BASE3_bit           _BIT_ACCESS(IVTBASEL,3)
// IVTBASEL<BASE4>
extern volatile __bit                   BASE4               __at(0x22EC);	// @ (0x45D * 8 + 4)
#define                                 BASE4_bit           _BIT_ACCESS(IVTBASEL,4)
// IVTBASEL<BASE5>
extern volatile __bit                   BASE5               __at(0x22ED);	// @ (0x45D * 8 + 5)
#define                                 BASE5_bit           _BIT_ACCESS(IVTBASEL,5)
// IVTBASEL<BASE6>
extern volatile __bit                   BASE6               __at(0x22EE);	// @ (0x45D * 8 + 6)
#define                                 BASE6_bit           _BIT_ACCESS(IVTBASEL,6)
// IVTBASEL<BASE7>
extern volatile __bit                   BASE7               __at(0x22EF);	// @ (0x45D * 8 + 7)
#define                                 BASE7_bit           _BIT_ACCESS(IVTBASEL,7)
// IVTBASEH<BASE8>
extern volatile __bit                   BASE8               __at(0x22F0);	// @ (0x45E * 8 + 0)
#define                                 BASE8_bit           _BIT_ACCESS(IVTBASEH,0)
// IVTBASEH<BASE9>
extern volatile __bit                   BASE9               __at(0x22F1);	// @ (0x45E * 8 + 1)
#define                                 BASE9_bit           _BIT_ACCESS(IVTBASEH,1)
// I2C1ERR<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCL1IF_bit          _BIT_ACCESS(I2C1ERR,5)
// I2C1ERR<BCLIE>
extern volatile __bit                   BCLIE               __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCLIE_bit           _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCLIF>
extern volatile __bit                   BCLIF               __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCLIF_bit           _BIT_ACCESS(I2C1ERR,5)
// I2C1STAT0<BFRE>
extern volatile __bit                   BFRE                __at(0x14C7);	// @ (0x298 * 8 + 7)
#define                                 BFRE_bit            _BIT_ACCESS(I2C1STAT0,7)
// I2C1CON2<BFRET0>
extern volatile __bit                   BFRET0              __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 BFRET0_bit          _BIT_ACCESS(I2C1CON2,0)
// I2C1CON2<BFRET1>
extern volatile __bit                   BFRET1              __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 BFRET1_bit          _BIT_ACCESS(I2C1CON2,1)
// MD1CON0<BIT>
extern volatile __bit                   BIT                 __at(0x350);	// @ (0x6A * 8 + 0)
#define                                 BIT_bit             _BIT_ACCESS(MD1CON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x248);	// @ (0x49 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// I2C1BTO<BTO0>
extern volatile __bit                   BTO0                __at(0x14E8);	// @ (0x29D * 8 + 0)
#define                                 BTO0_bit            _BIT_ACCESS(I2C1BTO,0)
// I2C1BTO<BTO1>
extern volatile __bit                   BTO1                __at(0x14E9);	// @ (0x29D * 8 + 1)
#define                                 BTO1_bit            _BIT_ACCESS(I2C1BTO,1)
// I2C1ERR<BTO1IE>
extern volatile __bit                   BTO1IE              __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTO1IE_bit          _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTO1IF>
extern volatile __bit                   BTO1IF              __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTO1IF_bit          _BIT_ACCESS(I2C1ERR,6)
// I2C1BTO<BTO2>
extern volatile __bit                   BTO2                __at(0x14EA);	// @ (0x29D * 8 + 2)
#define                                 BTO2_bit            _BIT_ACCESS(I2C1BTO,2)
// I2C1BTO<BTO3>
extern volatile __bit                   BTO3                __at(0x14EB);	// @ (0x29D * 8 + 3)
#define                                 BTO3_bit            _BIT_ACCESS(I2C1BTO,3)
// I2C1ERR<BTOIE>
extern volatile __bit                   BTOIE               __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 BTOIE_bit           _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTOIF>
extern volatile __bit                   BTOIF               __at(0x14BE);	// @ (0x297 * 8 + 6)
#define                                 BTOIF_bit           _BIT_ACCESS(I2C1ERR,6)
// DMAnBUF<BUF0>
extern volatile __bit                   BUF0                __at(0x748);	// @ (0xE9 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(DMAnBUF,0)
// DMAnBUF<BUF1>
extern volatile __bit                   BUF1                __at(0x749);	// @ (0xE9 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(DMAnBUF,1)
// DMAnBUF<BUF2>
extern volatile __bit                   BUF2                __at(0x74A);	// @ (0xE9 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(DMAnBUF,2)
// DMAnBUF<BUF3>
extern volatile __bit                   BUF3                __at(0x74B);	// @ (0xE9 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(DMAnBUF,3)
// DMAnBUF<BUF4>
extern volatile __bit                   BUF4                __at(0x74C);	// @ (0xE9 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(DMAnBUF,4)
// DMAnBUF<BUF5>
extern volatile __bit                   BUF5                __at(0x74D);	// @ (0xE9 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(DMAnBUF,5)
// DMAnBUF<BUF6>
extern volatile __bit                   BUF6                __at(0x74E);	// @ (0xE9 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(DMAnBUF,6)
// DMAnBUF<BUF7>
extern volatile __bit                   BUF7                __at(0x74F);	// @ (0xE9 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(DMAnBUF,7)
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x1B01);	// @ (0x360 * 8 + 1)
#define                                 BURSTMD_bit         _BIT_ACCESS(SCANCON0,1)
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0x156B);	// @ (0x2AD * 8 + 3)
#define                                 C0EN_bit            _BIT_ACCESS(U1CON2,3)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x387);	// @ (0x70 * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x381);	// @ (0x70 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x24FC);	// @ (0x49F * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x257C);	// @ (0x4AF * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x388);	// @ (0x71 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x389);	// @ (0x71 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR1<C1IP>
extern volatile __bit                   C1IP                __at(0x1B1C);	// @ (0x363 * 8 + 4)
#define                                 C1IP_bit            _BIT_ACCESS(IPR1,4)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x390);	// @ (0x72 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x391);	// @ (0x72 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x392);	// @ (0x72 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x386);	// @ (0x70 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x398);	// @ (0x73 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x399);	// @ (0x73 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x39A);	// @ (0x73 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x384);	// @ (0x70 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x380);	// @ (0x70 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x1A60);	// @ (0x34C * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x1A61);	// @ (0x34C * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x3A7);	// @ (0x74 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x3A1);	// @ (0x74 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE14<C2IE>
extern volatile __bit                   C2IE                __at(0x2562);	// @ (0x4AC * 8 + 2)
#define                                 C2IE_bit            _BIT_ACCESS(PIE14,2)
// PIR14<C2IF>
extern volatile __bit                   C2IF                __at(0x25E2);	// @ (0x4BC * 8 + 2)
#define                                 C2IF_bit            _BIT_ACCESS(PIR14,2)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x3A8);	// @ (0x75 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x3A9);	// @ (0x75 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR14<C2IP>
extern volatile __bit                   C2IP                __at(0x1B82);	// @ (0x370 * 8 + 2)
#define                                 C2IP_bit            _BIT_ACCESS(IPR14,2)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x3B0);	// @ (0x76 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x3B1);	// @ (0x76 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x3B2);	// @ (0x76 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x3A6);	// @ (0x74 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x3B8);	// @ (0x77 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x3B9);	// @ (0x77 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x3BA);	// @ (0x77 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x3A4);	// @ (0x74 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x3A0);	// @ (0x74 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x1A62);	// @ (0x34C * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x1A63);	// @ (0x34C * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x1A64);	// @ (0x34C * 8 + 4)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x1A65);	// @ (0x34C * 8 + 5)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,5)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1FB4);	// @ (0x3F6 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1FB5);	// @ (0x3F6 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1FB6);	// @ (0x3F6 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1A18);	// @ (0x343 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1A19);	// @ (0x343 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1A1A);	// @ (0x343 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x1A1B);	// @ (0x343 * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1A17);	// @ (0x342 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1A14);	// @ (0x342 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x250E);	// @ (0x4A1 * 8 + 6)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x258E);	// @ (0x4B1 * 8 + 6)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,6)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x1B2E);	// @ (0x365 * 8 + 6)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,6)
// PMD5<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD5,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1A10);	// @ (0x342 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1A11);	// @ (0x342 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1A12);	// @ (0x342 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1A13);	// @ (0x342 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1A15);	// @ (0x342 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x1278);	// @ (0x24F * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x1279);	// @ (0x24F * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x127A);	// @ (0x24F * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x127B);	// @ (0x24F * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x127C);	// @ (0x24F * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0x127D);	// @ (0x24F * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1A38);	// @ (0x347 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1A39);	// @ (0x347 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1A3A);	// @ (0x347 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x1A3B);	// @ (0x347 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1A37);	// @ (0x346 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1A34);	// @ (0x346 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE8<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x2536);	// @ (0x4A6 * 8 + 6)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE8,6)
// PIR8<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x25B6);	// @ (0x4B6 * 8 + 6)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR8,6)
// IPR8<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x1B56);	// @ (0x36A * 8 + 6)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR8,6)
// PMD5<CCP2MD>
