MikroElektronika/core_packages/PIC/XC8/def/PIC18F45Q43/mcu.h
extern volatile __bit                   T5GGO_nDONE         __at(0x19BB);	// @ (0x337 * 8 + 3)
#define                                 T5GGO_nDONE_bit     _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GPOL>
extern volatile __bit                   T5GPOL              __at(0x19BE);	// @ (0x337 * 8 + 6)
#define                                 T5GPOL_bit          _BIT_ACCESS(T5GCON,6)
// T5GPPS<T5GPPS0>
extern volatile __bit                   T5GPPS0             __at(0x1238);	// @ (0x247 * 8 + 0)
#define                                 T5GPPS0_bit         _BIT_ACCESS(T5GPPS,0)
// T5GPPS<T5GPPS1>
extern volatile __bit                   T5GPPS1             __at(0x1239);	// @ (0x247 * 8 + 1)
#define                                 T5GPPS1_bit         _BIT_ACCESS(T5GPPS,1)
// T5GPPS<T5GPPS2>
extern volatile __bit                   T5GPPS2             __at(0x123A);	// @ (0x247 * 8 + 2)
#define                                 T5GPPS2_bit         _BIT_ACCESS(T5GPPS,2)
// T5GPPS<T5GPPS3>
extern volatile __bit                   T5GPPS3             __at(0x123B);	// @ (0x247 * 8 + 3)
#define                                 T5GPPS3_bit         _BIT_ACCESS(T5GPPS,3)
// T5GPPS<T5GPPS4>
extern volatile __bit                   T5GPPS4             __at(0x123C);	// @ (0x247 * 8 + 4)
#define                                 T5GPPS4_bit         _BIT_ACCESS(T5GPPS,4)
// T5GCON<T5GSPM>
extern volatile __bit                   T5GSPM              __at(0x19BC);	// @ (0x337 * 8 + 4)
#define                                 T5GSPM_bit          _BIT_ACCESS(T5GCON,4)
// T5GATE<T5GSS0>
extern volatile __bit                   T5GSS0              __at(0x19C0);	// @ (0x338 * 8 + 0)
#define                                 T5GSS0_bit          _BIT_ACCESS(T5GATE,0)
// T5GATE<T5GSS1>
extern volatile __bit                   T5GSS1              __at(0x19C1);	// @ (0x338 * 8 + 1)
#define                                 T5GSS1_bit          _BIT_ACCESS(T5GATE,1)
// T5GATE<T5GSS2>
extern volatile __bit                   T5GSS2              __at(0x19C2);	// @ (0x338 * 8 + 2)
#define                                 T5GSS2_bit          _BIT_ACCESS(T5GATE,2)
// T5GATE<T5GSS3>
extern volatile __bit                   T5GSS3              __at(0x19C3);	// @ (0x338 * 8 + 3)
#define                                 T5GSS3_bit          _BIT_ACCESS(T5GATE,3)
// T5GATE<T5GSS4>
extern volatile __bit                   T5GSS4              __at(0x19C4);	// @ (0x338 * 8 + 4)
#define                                 T5GSS4_bit          _BIT_ACCESS(T5GATE,4)
// T5GATE<T5GSS5>
extern volatile __bit                   T5GSS5              __at(0x19C5);	// @ (0x338 * 8 + 5)
#define                                 T5GSS5_bit          _BIT_ACCESS(T5GATE,5)
// T5GCON<T5GTM>
extern volatile __bit                   T5GTM               __at(0x19BD);	// @ (0x337 * 8 + 5)
#define                                 T5GTM_bit           _BIT_ACCESS(T5GCON,5)
// T5GCON<T5GVAL>
extern volatile __bit                   T5GVAL              __at(0x19BA);	// @ (0x337 * 8 + 2)
#define                                 T5GVAL_bit          _BIT_ACCESS(T5GCON,2)
// T5CON<T5RD16>
extern volatile __bit                   T5RD16              __at(0x19B1);	// @ (0x336 * 8 + 1)
#define                                 T5RD16_bit          _BIT_ACCESS(T5CON,1)
// T6HLT<T6CKPOL>
extern volatile __bit                   T6CKPOL             __at(0x19EE);	// @ (0x33D * 8 + 6)
#define                                 T6CKPOL_bit         _BIT_ACCESS(T6HLT,6)
// T6CON<T6CKPS0>
extern volatile __bit                   T6CKPS0             __at(0x19E4);	// @ (0x33C * 8 + 4)
#define                                 T6CKPS0_bit         _BIT_ACCESS(T6CON,4)
// T6CON<T6CKPS1>
extern volatile __bit                   T6CKPS1             __at(0x19E5);	// @ (0x33C * 8 + 5)
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,5)
// T6CON<T6CKPS2>
extern volatile __bit                   T6CKPS2             __at(0x19E6);	// @ (0x33C * 8 + 6)
#define                                 T6CKPS2_bit         _BIT_ACCESS(T6CON,6)
// T6HLT<T6CKSYNC>
extern volatile __bit                   T6CKSYNC            __at(0x19ED);	// @ (0x33D * 8 + 5)
#define                                 T6CKSYNC_bit        _BIT_ACCESS(T6HLT,5)
// T6CLKCON<T6CS0>
extern volatile __bit                   T6CS0               __at(0x19F0);	// @ (0x33E * 8 + 0)
#define                                 T6CS0_bit           _BIT_ACCESS(T6CLKCON,0)
// T6CLKCON<T6CS1>
extern volatile __bit                   T6CS1               __at(0x19F1);	// @ (0x33E * 8 + 1)
#define                                 T6CS1_bit           _BIT_ACCESS(T6CLKCON,1)
// T6CLKCON<T6CS2>
extern volatile __bit                   T6CS2               __at(0x19F2);	// @ (0x33E * 8 + 2)
#define                                 T6CS2_bit           _BIT_ACCESS(T6CLKCON,2)
// T6CLKCON<T6CS3>
extern volatile __bit                   T6CS3               __at(0x19F3);	// @ (0x33E * 8 + 3)
#define                                 T6CS3_bit           _BIT_ACCESS(T6CLKCON,3)
// T6CLKCON<T6CS4>
extern volatile __bit                   T6CS4               __at(0x19F4);	// @ (0x33E * 8 + 4)
#define                                 T6CS4_bit           _BIT_ACCESS(T6CLKCON,4)
// T6CLKCON<T6CS5>
extern volatile __bit                   T6CS5               __at(0x19F5);	// @ (0x33E * 8 + 5)
#define                                 T6CS5_bit           _BIT_ACCESS(T6CLKCON,5)
// T6INPPS<T6INPPS0>
extern volatile __bit                   T6INPPS0            __at(0x1250);	// @ (0x24A * 8 + 0)
#define                                 T6INPPS0_bit        _BIT_ACCESS(T6INPPS,0)
// T6INPPS<T6INPPS1>
extern volatile __bit                   T6INPPS1            __at(0x1251);	// @ (0x24A * 8 + 1)
#define                                 T6INPPS1_bit        _BIT_ACCESS(T6INPPS,1)
// T6INPPS<T6INPPS2>
extern volatile __bit                   T6INPPS2            __at(0x1252);	// @ (0x24A * 8 + 2)
#define                                 T6INPPS2_bit        _BIT_ACCESS(T6INPPS,2)
// T6INPPS<T6INPPS3>
extern volatile __bit                   T6INPPS3            __at(0x1253);	// @ (0x24A * 8 + 3)
#define                                 T6INPPS3_bit        _BIT_ACCESS(T6INPPS,3)
// T6INPPS<T6INPPS4>
extern volatile __bit                   T6INPPS4            __at(0x1254);	// @ (0x24A * 8 + 4)
#define                                 T6INPPS4_bit        _BIT_ACCESS(T6INPPS,4)
// T6HLT<T6MODE0>
extern volatile __bit                   T6MODE0             __at(0x19E8);	// @ (0x33D * 8 + 0)
#define                                 T6MODE0_bit         _BIT_ACCESS(T6HLT,0)
// T6HLT<T6MODE1>
extern volatile __bit                   T6MODE1             __at(0x19E9);	// @ (0x33D * 8 + 1)
#define                                 T6MODE1_bit         _BIT_ACCESS(T6HLT,1)
// T6HLT<T6MODE2>
extern volatile __bit                   T6MODE2             __at(0x19EA);	// @ (0x33D * 8 + 2)
#define                                 T6MODE2_bit         _BIT_ACCESS(T6HLT,2)
// T6HLT<T6MODE3>
extern volatile __bit                   T6MODE3             __at(0x19EB);	// @ (0x33D * 8 + 3)
#define                                 T6MODE3_bit         _BIT_ACCESS(T6HLT,3)
// T6HLT<T6MODE4>
extern volatile __bit                   T6MODE4             __at(0x19EC);	// @ (0x33D * 8 + 4)
#define                                 T6MODE4_bit         _BIT_ACCESS(T6HLT,4)
// T6CON<T6ON>
extern volatile __bit                   T6ON                __at(0x19E7);	// @ (0x33C * 8 + 7)
#define                                 T6ON_bit            _BIT_ACCESS(T6CON,7)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x19E0);	// @ (0x33C * 8 + 0)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,0)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x19E1);	// @ (0x33C * 8 + 1)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x19E2);	// @ (0x33C * 8 + 2)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,2)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x19E3);	// @ (0x33C * 8 + 3)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,3)
// T6HLT<T6PSYNC>
extern volatile __bit                   T6PSYNC             __at(0x19EF);	// @ (0x33D * 8 + 7)
#define                                 T6PSYNC_bit         _BIT_ACCESS(T6HLT,7)
// T6RST<T6RSEL0>
extern volatile __bit                   T6RSEL0             __at(0x19F8);	// @ (0x33F * 8 + 0)
#define                                 T6RSEL0_bit         _BIT_ACCESS(T6RST,0)
// T6RST<T6RSEL1>
extern volatile __bit                   T6RSEL1             __at(0x19F9);	// @ (0x33F * 8 + 1)
#define                                 T6RSEL1_bit         _BIT_ACCESS(T6RST,1)
// T6RST<T6RSEL2>
extern volatile __bit                   T6RSEL2             __at(0x19FA);	// @ (0x33F * 8 + 2)
#define                                 T6RSEL2_bit         _BIT_ACCESS(T6RST,2)
// T6RST<T6RSEL3>
extern volatile __bit                   T6RSEL3             __at(0x19FB);	// @ (0x33F * 8 + 3)
#define                                 T6RSEL3_bit         _BIT_ACCESS(T6RST,3)
// T6RST<T6RSEL4>
extern volatile __bit                   T6RSEL4             __at(0x19FC);	// @ (0x33F * 8 + 4)
#define                                 T6RSEL4_bit         _BIT_ACCESS(T6RST,4)
// T6RST<T6RSEL5>
extern volatile __bit                   T6RSEL5             __at(0x19FD);	// @ (0x33F * 8 + 5)
#define                                 T6RSEL5_bit         _BIT_ACCESS(T6RST,5)
// T6RST<T6RSEL6>
extern volatile __bit                   T6RSEL6             __at(0x19FE);	// @ (0x33F * 8 + 6)
#define                                 T6RSEL6_bit         _BIT_ACCESS(T6RST,6)
// ADCON3<TMD0>
extern volatile __bit                   TMD0                __at(0x1FB0);	// @ (0x3F6 * 8 + 0)
#define                                 TMD0_bit            _BIT_ACCESS(ADCON3,0)
// ADCON3<TMD1>
extern volatile __bit                   TMD1                __at(0x1FB1);	// @ (0x3F6 * 8 + 1)
#define                                 TMD1_bit            _BIT_ACCESS(ADCON3,1)
// ADCON3<TMD2>
extern volatile __bit                   TMD2                __at(0x1FB2);	// @ (0x3F6 * 8 + 2)
#define                                 TMD2_bit            _BIT_ACCESS(ADCON3,2)
// TMR0H<TMR0H0>
extern volatile __bit                   TMR0H0              __at(0x18C8);	// @ (0x319 * 8 + 0)
#define                                 TMR0H0_bit          _BIT_ACCESS(TMR0H,0)
// TMR0H<TMR0H1>
extern volatile __bit                   TMR0H1              __at(0x18C9);	// @ (0x319 * 8 + 1)
#define                                 TMR0H1_bit          _BIT_ACCESS(TMR0H,1)
// TMR0H<TMR0H2>
extern volatile __bit                   TMR0H2              __at(0x18CA);	// @ (0x319 * 8 + 2)
#define                                 TMR0H2_bit          _BIT_ACCESS(TMR0H,2)
// TMR0H<TMR0H3>
extern volatile __bit                   TMR0H3              __at(0x18CB);	// @ (0x319 * 8 + 3)
#define                                 TMR0H3_bit          _BIT_ACCESS(TMR0H,3)
// TMR0H<TMR0H4>
extern volatile __bit                   TMR0H4              __at(0x18CC);	// @ (0x319 * 8 + 4)
#define                                 TMR0H4_bit          _BIT_ACCESS(TMR0H,4)
// TMR0H<TMR0H5>
extern volatile __bit                   TMR0H5              __at(0x18CD);	// @ (0x319 * 8 + 5)
#define                                 TMR0H5_bit          _BIT_ACCESS(TMR0H,5)
// TMR0H<TMR0H6>
extern volatile __bit                   TMR0H6              __at(0x18CE);	// @ (0x319 * 8 + 6)
#define                                 TMR0H6_bit          _BIT_ACCESS(TMR0H,6)
// TMR0H<TMR0H7>
extern volatile __bit                   TMR0H7              __at(0x18CF);	// @ (0x319 * 8 + 7)
#define                                 TMR0H7_bit          _BIT_ACCESS(TMR0H,7)
// PIE3<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x250F);	// @ (0x4A1 * 8 + 7)
#define                                 TMR0IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x258F);	// @ (0x4B1 * 8 + 7)
#define                                 TMR0IF_bit          _BIT_ACCESS(PIR3,7)
// IPR3<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x1B2F);	// @ (0x365 * 8 + 7)
#define                                 TMR0IP_bit          _BIT_ACCESS(IPR3,7)
// TMR0L<TMR0L0>
extern volatile __bit                   TMR0L0              __at(0x18C0);	// @ (0x318 * 8 + 0)
#define                                 TMR0L0_bit          _BIT_ACCESS(TMR0L,0)
// TMR0L<TMR0L1>
extern volatile __bit                   TMR0L1              __at(0x18C1);	// @ (0x318 * 8 + 1)
#define                                 TMR0L1_bit          _BIT_ACCESS(TMR0L,1)
// TMR0L<TMR0L2>
extern volatile __bit                   TMR0L2              __at(0x18C2);	// @ (0x318 * 8 + 2)
#define                                 TMR0L2_bit          _BIT_ACCESS(TMR0L,2)
// TMR0L<TMR0L3>
extern volatile __bit                   TMR0L3              __at(0x18C3);	// @ (0x318 * 8 + 3)
#define                                 TMR0L3_bit          _BIT_ACCESS(TMR0L,3)
// TMR0L<TMR0L4>
extern volatile __bit                   TMR0L4              __at(0x18C4);	// @ (0x318 * 8 + 4)
#define                                 TMR0L4_bit          _BIT_ACCESS(TMR0L,4)
// TMR0L<TMR0L5>
extern volatile __bit                   TMR0L5              __at(0x18C5);	// @ (0x318 * 8 + 5)
#define                                 TMR0L5_bit          _BIT_ACCESS(TMR0L,5)
// TMR0L<TMR0L6>
extern volatile __bit                   TMR0L6              __at(0x18C6);	// @ (0x318 * 8 + 6)
#define                                 TMR0L6_bit          _BIT_ACCESS(TMR0L,6)
// TMR0L<TMR0L7>
extern volatile __bit                   TMR0L7              __at(0x18C7);	// @ (0x318 * 8 + 7)
#define                                 TMR0L7_bit          _BIT_ACCESS(TMR0L,7)
// PMD1<TMR0MD>
extern volatile __bit                   TMR0MD              __at(0x308);	// @ (0x61 * 8 + 0)
#define                                 TMR0MD_bit          _BIT_ACCESS(PMD1,0)
// TMR1L<TMR10>
extern volatile __bit                   TMR10               __at(0x18E0);	// @ (0x31C * 8 + 0)
#define                                 TMR10_bit           _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR11>
extern volatile __bit                   TMR11               __at(0x18E1);	// @ (0x31C * 8 + 1)
#define                                 TMR11_bit           _BIT_ACCESS(TMR1L,1)
// TMR1H<TMR110>
extern volatile __bit                   TMR110              __at(0x18EA);	// @ (0x31D * 8 + 2)
#define                                 TMR110_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR111>
extern volatile __bit                   TMR111              __at(0x18EB);	// @ (0x31D * 8 + 3)
#define                                 TMR111_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR112>
extern volatile __bit                   TMR112              __at(0x18EC);	// @ (0x31D * 8 + 4)
#define                                 TMR112_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR113>
extern volatile __bit                   TMR113              __at(0x18ED);	// @ (0x31D * 8 + 5)
#define                                 TMR113_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR114>
extern volatile __bit                   TMR114              __at(0x18EE);	// @ (0x31D * 8 + 6)
#define                                 TMR114_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR115>
extern volatile __bit                   TMR115              __at(0x18EF);	// @ (0x31D * 8 + 7)
#define                                 TMR115_bit          _BIT_ACCESS(TMR1H,7)
// TMR1L<TMR12>
extern volatile __bit                   TMR12               __at(0x18E2);	// @ (0x31C * 8 + 2)
#define                                 TMR12_bit           _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR13>
extern volatile __bit                   TMR13               __at(0x18E3);	// @ (0x31C * 8 + 3)
#define                                 TMR13_bit           _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR14>
extern volatile __bit                   TMR14               __at(0x18E4);	// @ (0x31C * 8 + 4)
#define                                 TMR14_bit           _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR15>
extern volatile __bit                   TMR15               __at(0x18E5);	// @ (0x31C * 8 + 5)
#define                                 TMR15_bit           _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR16>
extern volatile __bit                   TMR16               __at(0x18E6);	// @ (0x31C * 8 + 6)
#define                                 TMR16_bit           _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR17>
extern volatile __bit                   TMR17               __at(0x18E7);	// @ (0x31C * 8 + 7)
#define                                 TMR17_bit           _BIT_ACCESS(TMR1L,7)
// TMR1H<TMR18>
extern volatile __bit                   TMR18               __at(0x18E8);	// @ (0x31D * 8 + 0)
#define                                 TMR18_bit           _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR19>
extern volatile __bit                   TMR19               __at(0x18E9);	// @ (0x31D * 8 + 1)
#define                                 TMR19_bit           _BIT_ACCESS(TMR1H,1)
// PIE3<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x250D);	// @ (0x4A1 * 8 + 5)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE3,5)
// PIR3<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x258D);	// @ (0x4B1 * 8 + 5)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR3,5)
// IPR3<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x1B2D);	// @ (0x365 * 8 + 5)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR3,5)
// TMR1H<TMR1H0>
extern volatile __bit                   TMR1H0              __at(0x18E8);	// @ (0x31D * 8 + 0)
#define                                 TMR1H0_bit          _BIT_ACCESS(TMR1H,0)
// TMR1H<TMR1H1>
extern volatile __bit                   TMR1H1              __at(0x18E9);	// @ (0x31D * 8 + 1)
#define                                 TMR1H1_bit          _BIT_ACCESS(TMR1H,1)
// TMR1H<TMR1H2>
extern volatile __bit                   TMR1H2              __at(0x18EA);	// @ (0x31D * 8 + 2)
#define                                 TMR1H2_bit          _BIT_ACCESS(TMR1H,2)
// TMR1H<TMR1H3>
extern volatile __bit                   TMR1H3              __at(0x18EB);	// @ (0x31D * 8 + 3)
#define                                 TMR1H3_bit          _BIT_ACCESS(TMR1H,3)
// TMR1H<TMR1H4>
extern volatile __bit                   TMR1H4              __at(0x18EC);	// @ (0x31D * 8 + 4)
#define                                 TMR1H4_bit          _BIT_ACCESS(TMR1H,4)
// TMR1H<TMR1H5>
extern volatile __bit                   TMR1H5              __at(0x18ED);	// @ (0x31D * 8 + 5)
#define                                 TMR1H5_bit          _BIT_ACCESS(TMR1H,5)
// TMR1H<TMR1H6>
extern volatile __bit                   TMR1H6              __at(0x18EE);	// @ (0x31D * 8 + 6)
#define                                 TMR1H6_bit          _BIT_ACCESS(TMR1H,6)
// TMR1H<TMR1H7>
extern volatile __bit                   TMR1H7              __at(0x18EF);	// @ (0x31D * 8 + 7)
#define                                 TMR1H7_bit          _BIT_ACCESS(TMR1H,7)
// PIE3<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x250C);	// @ (0x4A1 * 8 + 4)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x258C);	// @ (0x4B1 * 8 + 4)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x1B2C);	// @ (0x365 * 8 + 4)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR3,4)
// TMR1L<TMR1L0>
extern volatile __bit                   TMR1L0              __at(0x18E0);	// @ (0x31C * 8 + 0)
#define                                 TMR1L0_bit          _BIT_ACCESS(TMR1L,0)
// TMR1L<TMR1L1>
extern volatile __bit                   TMR1L1              __at(0x18E1);	// @ (0x31C * 8 + 1)
#define                                 TMR1L1_bit          _BIT_ACCESS(TMR1L,1)
// TMR1L<TMR1L2>
extern volatile __bit                   TMR1L2              __at(0x18E2);	// @ (0x31C * 8 + 2)
#define                                 TMR1L2_bit          _BIT_ACCESS(TMR1L,2)
// TMR1L<TMR1L3>
extern volatile __bit                   TMR1L3              __at(0x18E3);	// @ (0x31C * 8 + 3)
#define                                 TMR1L3_bit          _BIT_ACCESS(TMR1L,3)
// TMR1L<TMR1L4>
extern volatile __bit                   TMR1L4              __at(0x18E4);	// @ (0x31C * 8 + 4)
#define                                 TMR1L4_bit          _BIT_ACCESS(TMR1L,4)
// TMR1L<TMR1L5>
extern volatile __bit                   TMR1L5              __at(0x18E5);	// @ (0x31C * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x18E6);	// @ (0x31C * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x18E7);	// @ (0x31C * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x309);	// @ (0x61 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x18F0);	// @ (0x31E * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE3<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x250B);	// @ (0x4A1 * 8 + 3)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x258B);	// @ (0x4B1 * 8 + 3)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x1B2B);	// @ (0x365 * 8 + 3)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x30A);	// @ (0x61 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x1940);	// @ (0x328 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x1941);	// @ (0x328 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x194A);	// @ (0x329 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x194B);	// @ (0x329 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x194C);	// @ (0x329 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
